[
  {
    "title": "Partner won't meet my friends",
    "selftext": "Hey Brevkasse. I've been with my boyfriend for almost a year, and he still hasn't met my friends. Every time I suggest it, he comes up with an excuse. My friends have started asking if he even exists. I don't know what to do. Is this a red flag, or should I give him more time? He says he's shy, but for a whole year?",
    "label": "Love & Dating"
  },
  {
    "title": "My sister copies everything I do",
    "selftext": "My little sister (22) has started to imitate me (25) in a creepy way. She has dyed her hair the same color as mine, bought the same jacket, and now she has even applied to the same program that I attend. I have tried to talk to her about it, but she just says that she looks up to me. I feel suffocated and am losing my identity. How do I handle this without hurting her?",
    "label": "Family Dynamics"
  },
  {
    "title": "Feeling overlooked at my new student job",
    "selftext": "I started a new student job a month ago, and I feel completely ignored. My colleagues only talk to each other, and my boss gives me only the most boring tasks. I have tried to take initiative and ask if I can help with more, but I am rejected. Should I just find something new, or is this normal at the start?",
    "label": "Work, Study & Career"
  },
  {
    "title": "How do you make new friends as an adult?",
    "selftext": "I moved to a new city half a year ago because of work. I am 32 and find it difficult to meet new people. Everyone seems to have their own established friend groups. I've tried fitness and a book club, but it hasn't really worked out. I feel quite lonely on weekends. What are your best tips for making new friendships in your 30s?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "Constant headache - the doctor says it's stress",
    "selftext": "Hi everyone. The last three months I've had headaches almost every day. It's a pressing feeling in the forehead and temples. My doctor has examined me and says it's probably tension headache due to stress. I've been given some exercises, but they don't really help. Has anyone else tried it? What helped you?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "Should we have a joint economy or not?",
    "selftext": "My partner and I are moving in together. I earn a lot more than him, and now we are discussing how to handle the finances. He suggests that we just split all fixed expenses 50/50, but that would leave him with very little money for himself. I have suggested a percentage split, but he feels that it is a 'disadvantage'. How have you others solved it?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "What is the best method to clean windows?",
    "selftext": "Every time I clean windows, it ends up with streaks all over. I've tried everything: newspaper, vinegar, expensive window scrapers, and various cleaning agents. Nothing works! What is your secret trick to get completely clean and streak-free windows? I'm going crazy.",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People who don't keep to the right on the escalator",
    "selftext": "Am I the only one who becomes insanely irritated by people standing on the left side of the escalator? Especially during rush hour at Nørreport. There's an unwritten rule that you stand to the right so that people in a hurry can walk to the left. Why is it so hard to understand? It's a small thing, but it drives me to madness every day.",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend is friends with his ex on social media",
    "selftext": "I have discovered that my boyfriend still follows his ex on Instagram and likes her pictures. He says they're just friends, and that it doesn't mean anything. But I can't help feeling a sting of jealousy. Am I being unreasonable and insecure, or is it okay to ask him to stop following her?",
    "label": "Love & Dating"
  },
  {
    "title": "My parents interfere in our child-rearing",
    "selftext": "Every time my parents babysit our 4‑year‑old son, they completely ignore our rules. We have a clear agreement of no sugar before dinner and limited screen time. But when we pick him up, he has eaten candy and watched the iPad for hours. I love that they want to help, but I don't feel they respect us as parents. How do I talk to them without starting a family war?",
    "label": "Family Dynamics"
  },
  {
    "title": "Regretting my study choice - what now?",
    "selftext": "I started law two months ago, and I already hate it. It's dry, boring, and I can't see myself as a lawyer. I feel huge pressure from my family to continue because it's a 'prestigious' degree. But I am deeply unhappy. Should I drop out now, or should I give it the rest of the semester a chance?",
    "label": "Work, Study & Career"
  },
  {
    "title": "My friend always cancels at the last minute",
    "selftext": "I have a friend whom I care about a lot, but she cancels our appointments 9 out of 10 times – often with a text message an hour before we are supposed to meet. I get so disappointed every time, because I have been looking forward to it. I have tried to say that it hurts me, but she just apologizes and does it again. Is it time to drop the friendship?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "Sleep problems and racing thoughts",
    "selftext": "I simply can't fall asleep in the evening. As soon as I lay my head on the pillow, my brain starts running at 180. I think about work, about what I should have said in a conversation, about the future... all sorts of things. I've tried meditation and reading a book, but it doesn't work. Does anyone have good advice against racing thoughts at bedtime?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "Is it foolish to buy a co-op apartment right now?",
    "selftext": "My partner and I are considering buying our first home and are looking at a co-op apartment. But with rising interest rates and the uncertain economy, I am unsure whether it is a bad investment. Many say that the co-op market is a bubble that could burst. What are your experiences? Is it too risky to buy a share now?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "How to remove limescale from the shower cabin?",
    "selftext": "Our bathroom is a nightmare of limescale. Especially the glass wall in the shower cabin is completely white and matte. I have tried all the common cleaning agents, but nothing really bites it. Is there a miracle solution or a method that actually works against stubborn limescale? All tips are received with a cold hand!",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "Cyclists who ride without lights in the dark",
    "selftext": "I get so furious when I see cyclists without lights in the evening. It's pitch black outside, and they are dressed in black clothing. It's dangerous for both them and for us others in traffic. Do a pair of bicycle lights really cost so much that one would risk one's life? Where has the sense of responsibility gone?",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "Date a guy who never takes initiative",
    "selftext": "I’ve been dating a guy for a couple of months, and I really like him. But it’s always me who has to write first, and me who has to suggest that we meet. When we’re together, he’s sweet and present, but as soon as we’re apart, I hear nothing from him. Is he just not interested enough, or are some men just like that?",
    "label": "Love & Dating"
  },
  {
    "title": "Should I force my teenage son to attend family birthdays?",
    "selftext": "My 15-year-old son refuses to go to family birthdays. He says it's boring, and he'd rather be with his friends. I understand him well, but I also think it's rude to the family, especially his grandparents, who get upset about it. How much should one push? Is it a fight worth taking?",
    "label": "Family Dynamics"
  },
  {
    "title": "How to handle a gossiping colleague?",
    "selftext": "There is a colleague at my workplace who spreads gossip about everything and everyone. She is nice enough face-to-face, but I have heard from others that she has said negative things about me behind my back. This creates a really bad atmosphere in the office. Should I confront her, go to the boss, or just ignore it?",
    "label": "Work, Study & Career"
  },
  {
    "title": "I feel like a third wheel in my own friend group",
    "selftext": "My two best girlfriends have gotten boyfriends almost at the same time, and now I feel totally left out. When we are together, they only talk about their relationships, and all our plans now also involve their boyfriends. I am happy for them, but I miss our old friendship. Is it selfish of me to feel this way?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "Tired all the time - what could it be?",
    "selftext": "Recently I have felt completely drained of energy. I sleep 8 hours every night, eat healthy and exercise, but I am still chronically tired. It affects my work and my social life. My doctor has taken blood tests that look fine. Could it really just be winter fatigue, or should I be concerned?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "Is a savings account enough, or should I invest?",
    "selftext": "I finally managed to save a good sum of money, which just sits on a regular savings account. My friends keep talking about stocks and investments, and say that I'm losing money because of inflation. But I know nothing about it and I'm afraid of losing it all. Is it dumb to just leave the money sitting, or should I dive into investing?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "Best advice for removing red wine stains?",
    "selftext": "The disaster has happened! I have spilled a whole glass of red wine on my new, light sofa. I dabbed it immediately with a cloth, but the stain is still there. What is the absolute best housewife advice for removing red wine stains from fabric? I've heard something about salt and potato starch, but I don't want to experiment. Help!",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "Why do people leave their shopping carts in the middle of the parking lot?",
    "selftext": "I simply don't understand it. People take a shopping cart, use it, and then leave it in the middle of a parking bay, 10 meters away from where it should be. It's laziness at a whole new level. It literally takes 30 seconds to drive it into place. Is it really too much to ask that one cleans up after themselves?",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend is much more social than I am",
    "selftext": "I love my boyfriend, but we are very different. He loves being social and wants to go out with friends every weekend. I am more introverted and need an evening on the sofa to recharge. He gets disappointed when I don't want to go, and I feel guilty. Can a relationship between an extrovert and an introvert work in the long run?",
    "label": "Love & Dating"
  },
  {
    "title": "My mother-in-law criticizes everything about me",
    "selftext": "Since I got married to my husband, my mother-in-law has had an opinion on everything: my clothes, my cooking, how I raise our child. It's always small, prickly comments packaged as 'good advice'. My husband says I should ignore it, but it's hard. It ruins my mood every time we have to see her. What do I do?",
    "label": "Family Dynamics"
  },
  {
    "title": "How do you ask for a raise?",
    "selftext": "I have been in my job for two years now, have taken on more responsibility and deliver good results. I think I deserve a salary increase, but I am SO nervous about asking. What do you say? Should you have a specific amount in mind? And what do you do if the boss says no? All tips to prepare for the salary conversation are welcome!",
    "label": "Work, Study & Career"
  },
  {
    "title": "Should I confront my friend who owes me money?",
    "selftext": "I lent my friend 2000 kr. half a year ago, when he was in a bind. He promised to pay them back the following month, but I still haven't seen a single cent. He posts pictures from bar nights and restaurant visits on Instagram, so it's not that he doesn't have money. It's awkward, but I need the money. How do I push for it without ruining the friendship?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "Back pain after a full day on the office chair",
    "selftext": "I have an office job and sit down most of the day. When I come home, I always have back pain. I have tried adjusting my chair, standing up at regular intervals, and doing stretching exercises, but nothing seems to help permanently. Is there anyone who has found a solution to the classic office back pain?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "My landlord won't repair things in the apartment",
    "selftext": "My refrigerator has broken, and my landlord has ignored my requests for several weeks. I have written and called, but he does not answer. What are my rights as a tenant? Can I buy a new one myself and deduct it from the rent? I am afraid of being evicted if I do something wrong. What is the procedure?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "Which air fryer should I choose?",
    "selftext": "The whole world is talking about air fryers, and now I also want to jump on the wave. But it's a jungle! There are so many brands and models. What should you look for? Are the expensive models worth the money? Which one do you have, and can you recommend it? I will primarily use it for vegetables and French fries for two people.",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "The Neighbor's Noisy Renovation Project",
    "selftext": "My upstairs neighbor has been renovating his apartment for what feels like half a year. They drill, hammer, and sand from early morning to late evening – even on weekends. I work from home, and the noise is driving me crazy. I've tried to speak politely to them, but they don't care. How much noise should one accept from neighbors?",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend is jealous of my male friends",
    "selftext": "I have always had many male friends, and it has never been a problem. But my new boyfriend gets angry and suspicious every time I go to see one of them. He says, 'men and women cannot be friends'. I love him, but I don't want to give up my friendships. How can I get him to understand that he has nothing to worry about?",
    "label": "Love & Dating"
  },
  {
    "title": "Should I invite my father's new girlfriend to Christmas?",
    "selftext": "My parents got divorced last year, and my father has a new girlfriend. I've only met her once, and I'm not fond of her. Now my father is asking if she can come with him for Christmas Eve. I want to say no because it feels too early, and I'm afraid it will hurt my mother, who will also be there. But I also don't want to make my father sad. What should I do?",
    "label": "Family Dynamics"
  },
  {
    "title": "Feeling inadequate in my studies",
    "selftext": "I have started university and feel like the dumbest in the class. Everyone else seems to understand the curriculum right away, while I have to read the texts three times to grasp the point. I'm afraid that I'm not smart enough to finish the program. Is it normal to feel this way at the beginning, or have I chosen the wrong study?",
    "label": "Work, Study & Career"
  },
  {
    "title": "My friend has started dating my ex",
    "selftext": "My good friend has started dating my ex. It's only been a couple of months since we broke up. He asked me for permission, and I said it was okay because I didn't want to seem petty. But honestly it hurts. I feel betrayed. Do I have the right to be angry, even though I gave the 'green light'?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "Do I get palpitations from coffee - should I stop?",
    "selftext": "I love my morning coffee, but lately I've noticed that I get palpitations and feel a bit tense after drinking it. It's quite uncomfortable. Is this a sign that my body can no longer tolerate caffeine? Is there anyone who has tried switching to caffeine-free coffee and noticed a difference?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "How do you best save for the down payment on a house?",
    "selftext": "My partner and I dream of buying a house in a couple of years, but the 5% down payment seems like an overwhelming amount. We both have steady incomes, but it's hard to set aside much each month. What are your best saving tips? Have you used a particular budgeting app, invested the money, or simply cut out all unnecessary expenses?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "Which robot vacuum is best for pet hair?",
    "selftext": "We have a dog that sheds extremely, and I'm going crazy over the amounts of dog hair everywhere. I'm considering investing in a robot vacuum, but which is best at handling pet hair? I want one that doesn't constantly get the hair tangled in the brush. Recommendations are gladly received!",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "Why do people talk on speakerphone in the bus?",
    "selftext": "I experience it almost daily on public transport: People who have private conversations on speakerphone, so the whole bus can listen in. Why? What happened to ordinary politeness and consideration for others? I don't want to hear about your neighbor's divorce or your doctor's appointment. Is it just me who is sensitive?",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "I am unsure whether I want children",
    "selftext": "My boyfriend and I are both in our early 30s, and he has started talking a lot about having children. I have always believed that I would want them too, but now that it is becoming more concrete, I am in doubt. I love my life as it is, with freedom and spontaneity. Is it selfish not to want children? And how do I tell him that without breaking his heart?",
    "label": "Love & Dating"
  },
  {
    "title": "My brother constantly asks for money",
    "selftext": "My younger brother is in his 20s and has a really bad financial situation. He calls me several times a month and asks to borrow money for rent or food. I love him and want to help, but it's becoming a habit. I feel like I'm enabling his irresponsibility. How do I say no without creating a huge family conflict?",
    "label": "Family Dynamics"
  },
  {
    "title": "How do you handle a bad work environment?",
    "selftext": "I recently started a new job, but the atmosphere is terrible. The tone is harsh, there's a lot of gossip, and I don't feel welcome. I need the job, but I'm dreading going out every morning. Do you have any advice on how to navigate a toxic work environment until I can find something else?",
    "label": "Work, Study & Career"
  },
  {
    "title": "I feel like I'm always the one who takes initiative",
    "selftext": "In my friend group it's always me who arranges that we meet. If I didn't write in our group chat, I honestly think it could take months before we see each other. I feel a bit sad that it always has to come from me. Does that mean they don't value my friendship as highly, or is it just that the dynamic has changed?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "Is it normal to have knee pain when running?",
    "selftext": "I started running to get in better shape, but every time I've gone out, I have knee pain the next day. Is it just a beginner thing, because my body needs to get used to it, or is it a sign that I'm doing something wrong? I've invested in good running shoes, so it shouldn't be that. Should I just bite the pain?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "Disagreement over vacation budget with my partner",
    "selftext": "My partner and I are planning a summer vacation, but we are deeply at odds about the budget. I would like a somewhat luxurious trip with a nice hotel, since we haven't taken a vacation in a while. He would rather go on a cheap camping trip to save money. How do you find a compromise when you have completely different wishes for what a vacation should cost and include?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "Which type of coffee machine is best?",
    "selftext": "My old filter coffee machine has stopped working, and I need a new one. But the market has exploded. Should I get a new filter machine, a capsule machine, or a fully automatic espresso machine? I mostly drink black coffee in the morning. What are your experiences, and what gives the most value for money?",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "Dog owners who do not pick up after their dog",
    "selftext": "I am so tired of having to zig‑zag between dog poop every time I go for a walk on the sidewalk in my neighborhood. How hard can it be to have a bag and pick up after your dog? It's disrespectful to everyone else who lives and moves around here. Is it just me who thinks it has gotten worse in recent years?",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend is bad at giving gifts",
    "selftext": "I love my boyfriend, but he is genuinely bad at giving gifts. For my birthday I received a frying pan (I hate cooking), and for Christmas I received a vacuum cleaner. I know he means well, but it feels so impersonal. How can I politely tell him that I would like something more romantic, without sounding ungrateful?",
    "label": "Love & Dating"
  },
  {
    "title": "My parents expect us to spend Christmas at their place every year",
    "selftext": "My husband and I really want to try spending Christmas just the two of us and our little child this year. But my parents take it for granted that we come to them, just as we have done every other year. I know they will be crushed if we say no. How do you tell your family that you want to start your own Christmas traditions without making them feel rejected?",
    "label": "Family Dynamics"
  },
  {
    "title": "Is it okay to quit without having a new job?",
    "selftext": "I am so burnt out and demotivated at my current job that I am considering quitting, even though I don't have a new job in hand. The thought of having to continue here for several months is unbearable. But reason tells me that it is financially irresponsible. Has anyone among you tried taking the leap into the unknown? How did it go?",
    "label": "Work, Study & Career"
  },
  {
    "title": "Feeling left out in the mothers' group",
    "selftext": "I've joined a mothers' group where the other three mothers already knew each other. They're super sweet, but I feel like the fifth wheel. They have a lot of inside jokes, and the conversation often turns to things I can't relate to. I feel lonely, even though I'm surrounded by people. Should I just accept it, or should I try to find another group?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "Having trouble falling asleep without watching a series",
    "selftext": "I have become dependent on falling asleep to a series on my tablet every evening. If I don't do that, I just lie down and flip and turn myself for hours. I know that screen light before bedtime is a bad idea, but it's the only thing that can get my brain to relax. Are there others who feel the same way? And have you found a better solution?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "How do you negotiate a better interest rate at the bank?",
    "selftext": "We need to borrow money from the bank to renovate our house, but the interest rate they have offered us seems quite high. I've heard that you can negotiate the rate, but how do you do that in practice? Should you bring offers from other banks? Which arguments work best with the bank advisor? I'm completely new to this area.",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "Good ideas for a cheap autumn holiday with kids?",
    "selftext": "The autumn break is approaching, and we would like to do something cozy with our children (6 and 9 years old), but the budget is tight this year. Do you have any good ideas for cheap or free activities during the autumn break? It could be anything from nature walks to creative projects at home. We live near Copenhagen, but all suggestions are welcome.",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People who throw trash on the street",
    "selftext": "I simply get so provoked when I see people throw their takeaway packaging or cigarette butts on the ground, even though there's a trash bin 5 meters away. Why is it so hard to clean up after themselves? Our city looks like a landfill in some places. Do people just lack complete respect for our shared surroundings?",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend is unambitious",
    "selftext": "I am a very ambitious person, both career-wise and personally. My boyfriend is the exact opposite. He is satisfied with his 8-16 job, and his biggest ambition on the weekend is to watch football. I love him, but I am afraid that in the long run we will grow apart because we want different things in life. Can a relationship work when you have such different ambition levels?",
    "label": "Love & Dating"
  },
  {
    "title": "How do you handle a dominating father-in-law?",
    "selftext": "My father-in-law is the type who always thinks he knows best. No matter what we talk about, he takes over the conversation and lectures everyone on how things work. He criticizes my decisions (from car purchases to child-rearing) and never listens to what others say. It is exhausting to be around him. My husband doesn't dare say anything. How can I set a boundary in a respectful way?",
    "label": "Family Dynamics"
  },
  {
    "title": "I'm bored at work, but I don't dare to change",
    "selftext": "I’ve had the same job for 7 years, and I’m bored out of my mind. The tasks are the same, and there are no opportunities for development. I dream of trying something new, but I’m a safety addict and I’m afraid to leave a secure job for something uncertain. What if I regret it? How does one know when it’s time to take the leap?",
    "label": "Work, Study & Career"
  },
  {
    "title": "My friend only talks about herself",
    "selftext": "Every time I meet my friend, the entire conversation is about her, her job, her boyfriend, her problems. She never asks about me or how I'm doing. If I try to say something, she quickly interrupts and brings the topic back to herself. I feel more like a therapist than a friend. Is it unreasonable for me to expect more from the friendship?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "How do you get started with training when you hate it?",
    "selftext": "I know I should exercise. For my health's sake. But I hate it. I hate sweating, I hate being out of breath, and I find gyms depressing. I've tried everything – running, group classes, yoga – but I lose motivation after a couple of weeks. How do you find a workout you actually want to do when you're basically lazy?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "How much is reasonable to spend on a wedding gift?",
    "selftext": "My good friend is getting married, and I'm unsure how much I should give as a gift. I'm a student, so my budget isn't large, but I also don't want to appear stingy. What is the 'normal' amount to give as a friend? And is it okay to combine with other friends for a larger gift?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "Good suggestions for an easy and quick everyday dish?",
    "selftext": "I am completely fed up with cooking dinner. It always ends up with the same 5-6 dishes. I need inspiration for something new that is both easy, quick, and healthy to make on a busy everyday life. What is your go-to everyday dish that the whole family likes? All recipes and ideas are welcome!",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "The neighbor's dog keeps barking",
    "selftext": "My neighbor's dog is home alone most of the day, and it keeps barking. It's impossible to concentrate when working from home, and it's generally just a stressful sound to listen to. I left a friendly note in their mailbox, but nothing has happened. What is the next step? Should I knock, or is that too confrontational?",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "I don't feel in love anymore - is that normal?",
    "selftext": "My boyfriend and I have been together for 4 years. I love him, but I don't feel \"in love\" anymore. The butterflies in my stomach are gone, and everyday life has taken over. Is that just how a long-term relationship is? Or is it a sign that something is wrong? I'm afraid that I'm falling out of love.",
    "label": "Love & Dating"
  },
  {
    "title": "My adult son does not want to move out",
    "selftext": "My son is 25 years old and still lives at home. He has a job, but he spends all his money on nightlife and gadgets and does nothing to save up to move. We love him, but we also want our house back for ourselves again. How do you motivate an adult child to take responsibility and move out, without throwing him out the door?",
    "label": "Family Dynamics"
  },
  {
    "title": "I don't feel good enough for my job",
    "selftext": "I suffer from 'imposter syndrome'. I am afraid that my colleagues and my boss will one day discover that I am not as competent as they think. Every time I get a new task, I am convinced that I cannot solve it, even though I always end up doing it. It is so exhausting to live with constant self-doubt. How do you fight it?",
    "label": "Work, Study & Career"
  },
  {
    "title": "My friend has become a completely different person",
    "selftext": "My friend has gotten a new boyfriend, and she has changed completely. She has started to dress in designer clothes and eat at expensive restaurants, which is nothing like her. She talks down to me about my 'ordinary' life. It's as if she has become snobbish. I miss the person she was before. Is it possible to save the friendship, or should I just let go?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "Can you train yourself out of a bad posture?",
    "selftext": "I have a terrible posture. I slump in my back and push my shoulders forward, especially when I sit down. It doesn't look good, and I start to get neck pain. Is there anyone who has had success improving their posture? Which exercises work? Or is it too late to fix it when you're an adult?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "Rental apartment with pets - is it impossible to find?",
    "selftext": "My partner and I would really like to have a dog, but we rent, and it seems almost impossible to find an apartment in Copenhagen where pets are allowed. We are stable tenants with a steady income. Why are landlords so afraid of pets? And do you have any tips on where to look, or how to convince a landlord?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "Which streaming subscription is worth the money?",
    "selftext": "I have Netflix, but I'm considering switching or adding another streaming service. There are so many: HBO Max, Disney+, Viaplay, Prime Video... Which service do you think gives the most for the money in terms of the selection of movies and series? I'm most into drama, crime, and good documentaries.",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People who don't use turn signals in roundabouts",
    "selftext": "It is one of my biggest frustrations in traffic. People who drive into a roundabout and leave it again without signaling. You stop and wait because you think they will continue around, and then they just turn off. How hard can it be to use the little lever at the steering wheel? It's a matter of both safety and common courtesy.",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend is unromantic",
    "selftext": "My boyfriend is a fantastic man, but he is totally unromantic. No flowers, no little surprises, no compliments. I know he loves me, but I miss the little romantic gestures. I've tried to hint at it, but he doesn't catch it. How can I explain to him what I need without it sounding like an accusation?",
    "label": "Love & Dating"
  },
  {
    "title": "My parents favor my sister",
    "selftext": "I have always felt that my parents favor my little sister. She always gets more attention, more praise, and more financial help. When I point it out, they say I'm imagining things. It makes me sad and creates a distance between me and them. Are there others who have experienced being 'the other child', and how do you handle it?",
    "label": "Family Dynamics"
  },
  {
    "title": "How do you network without it feeling awkward?",
    "selftext": "I am a recent graduate and am about to start job hunting. Everyone says that networking is essential, but I hate it. I feel fake and awkward when I have to approach strangers at career fairs and \"sell myself\". Do you have any good advice on how to network in a more natural and authentic way?",
    "label": "Work, Study & Career"
  },
  {
    "title": "I am the only single in the friend group",
    "selftext": "All my friends are in steady relationships, and I am the eternal single. I am happy for them, but it is also lonely. They have couple dinners, and I am always the odd number. I feel like a reminder of what I don't have. How does one avoid becoming bitter and enjoy one's own company when everyone around is in a couple?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I am addicted to sugar - how do I stop?",
    "selftext": "I have a serious craving for sugar, especially in the afternoon and evening. I can eat an entire plate of chocolate without any problems. I know it's unhealthy, and I want to stop, but it's so difficult. It feels like a real addiction. Has anyone of you had success in getting rid of sugar? What was your strategy?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "Is it too late to start a pension savings?",
    "selftext": "I am in the middle of my 40s and have never really thought about retirement. Now it has started to stress me. I only have the pension I get through my job, and that's apparently not much. Has the run already passed me? Is it even worth it to start a private savings now, or is it too late to manage to save a reasonable amount?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "How do you keep your white sneakers white?",
    "selftext": "I love white sneakers, but I'm going crazy about how quickly they get dirty. No matter how careful I am, they always end up looking gray and sad after a short time. What is your best trick for cleaning them and keeping them nice and white? Is there a particular cleaning agent or method that works every time?",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "Neighbors who keep parties until 4 a.m.",
    "selftext": "My downstairs neighbors throw parties almost every weekend. The music pumps, and people shout and scream on the balcony until late into the night. I have small children who wake up because of it. I've tried knocking on the door and asking them to turn it down, but they don't care. What do you do? Should you call the police, or is there another way to handle it?",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend is on his phone all the time",
    "selftext": "When my boyfriend and I are together, he is constantly on his phone. He scrolls through Instagram while we watch movies, checks the news while we eat, and answers messages while I talk to him. I feel ignored and de-prioritized. I have told him, but he thinks I'm overreacting. How can I get him to understand that it hurts me?",
    "label": "Love & Dating"
  },
  {
    "title": "My parents will not accept my boyfriend",
    "selftext": "I have a boyfriend whom I am really happy with. The problem is that my parents don't like him. They don't think he's 'good enough' because he's a tradesman and doesn't have a university degree. They are cold and rejecting when he visits. It's so painful. Should I just accept it, or should I confront them?",
    "label": "Family Dynamics"
  },
  {
    "title": "I feel exploited at work",
    "selftext": "I am the type who always says yes. Yes to extra tasks, yes to staying longer, yes to helping colleagues. The result is that I am constantly overburdened and stressed, while others take their time off on schedule. I have difficulty saying no because I want to be a good colleague. But I can feel that I am burning out. How do you learn to set boundaries at the workplace?",
    "label": "Work, Study & Career"
  },
  {
    "title": "My friend has started dating someone I don't like",
    "selftext": "My best friend has gotten a new boyfriend, whom I think is arrogant and unpleasant. He talks down to her and interrupts her all the time. She seems happy, but I am worried about her. Should I intervene and say my honest opinion, or should I keep my mouth shut and hope that she sees it herself? I am afraid of losing her if I criticize her choice.",
    "label": "Friendship & Social Life"
  },
  {
    "title": "How do you find motivation to eat healthy?",
    "selftext": "I know what I *should* eat, but when it comes to the actual part, I always choose the easy and unhealthy solution. Pizza, burger, sweets... The motivation to make a healthy salad just doesn't exist after a long workday. How do you other people find motivation to eat healthy in everyday life? Are there any tricks that make it easier?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "Is it cheaper to shop in Germany?",
    "selftext": "I am considering taking a trip over the border to do a big shopping spree. Are there really that many savings on groceries such as soda, candy, meat, and cleaning supplies? Or will the savings be eaten up by fuel costs? What are your experiences, and which items are best to buy in Germany?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "What is the best gift for someone who 'doesn't want anything'?",
    "selftext": "My dad's birthday is coming up, and as always he says he doesn't want anything. That makes it impossible to find a gift! What do you give to the man who has everything (or says he has)? I would like to give something more personal than a bottle of wine or a book. Good ideas for the 'giftless' man are welcome!",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People Who Don't Keep Distance in the Queue",
    "selftext": "Am I the only one who hates it when people stand right up against someone in the supermarket queue? I can feel their breath on my neck and see what they're typing on the card terminal. What happened to personal space? It's so unnecessary and intrusive. Give me just 50 cm of space, please!",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend doesn't want sex anymore",
    "selftext": "In the beginning of our relationship, my boyfriend and I had a fantastic sex life. But in the last year he has almost no desire. He always rejects me when I take the initiative, and says he is tired. I feel unattractive and rejected. I have tried to talk to him about it, but he just shuts down. What could be wrong, and what should I do?",
    "label": "Love & Dating"
  },
  {
    "title": "How do you handle Christmas when you are a child of divorce?",
    "selftext": "I am an adult now, but I still hate Christmas. It's a logistical nightmare having to split between my mother's and father's families. No matter what I do, there's always someone who gets disappointed. I just wish I could spend Christmas in one place, but I feel guilty. Are there other adult children of divorce who have found a good solution?",
    "label": "Family Dynamics"
  },
  {
    "title": "I am afraid of speaking in front of other people",
    "selftext": "I have a job where I sometimes have to present something to my colleagues, and I hate it. My heart starts pounding, I sweat, and I stutter. I am so afraid of saying something stupid or freezing. It is starting to limit me in my career. Do you have any advice on how to overcome presentation anxiety?",
    "label": "Work, Study & Career"
  },
  {
    "title": "Is it okay to 'break up' with a friend?",
    "selftext": "I have a friend who drains my energy. He is always negative, constantly complains, and only talks about his own problems. I can't stand being with him anymore, because I always end up in a bad mood. But how do you end a friendship? Do you say it directly, or just let it slip into the sand? It feels so brutal.",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I can't sleep when there's a full moon",
    "selftext": "It may sound crazy, but I always sleep badly when there's a full moon. I lie down and turn and twist and can't find peace at all. I've read that it's a myth, but I experience it again and again. Are there others who feel the same way? And is there anything that helps?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "How do you set a budget that you actually stick to?",
    "selftext": "Every month I start with the best intentions. I set a nice budget in a spreadsheet, but after a week everything has slipped. I am too impulsive with my money and quickly lose sight of the big picture. Is there a foolproof method or an app that can help an economically undisciplined person like me keep track of money?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "Good advice to avoid food waste?",
    "selftext": "I am shocked over how much food we throw away at home. Vegetables that go bad, leftovers that get forgotten at the back of the fridge... I really want to get better at avoiding food waste, both for the environment and for the wallet. What are your best tips? Do you plan meals, use certain apps, or have a fixed 'leftover day'?",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People who talk in the cinema",
    "selftext": "Why is there always someone who feels the need to comment on the film while it's playing in the cinema? 'Hey, who was that?', 'Look, something is happening now!'. Keep your mouth shut! I paid to watch the film, not to hear your private commentary track. It ruins the whole experience. Show some respect for the others in the hall.",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "I'm afraid of getting attached",
    "selftext": "I have been dating a guy for half a year, and he is everything I could wish for. Now he has started talking about the future and moving in together, and I'm panicking. I have a history of sabotaging good relationships as soon as they become too serious. I'm afraid of getting hurt. How do you learn to dare to commit and trust love?",
    "label": "Love & Dating"
  },
  {
    "title": "My husband won't help at home",
    "selftext": "I feel like I'm carrying all the household chores. I wash clothes, clean, shop, and cook while my husband sits on the sofa when he comes home from work. I also work full time. I've tried talking to him about it, but he thinks I'm better at it, and therefore it's 'easier' for me to do it. I'm about to explode. What do I do?",
    "label": "Family Dynamics"
  },
  {
    "title": "Feeling lonely at work",
    "selftext": "I work in an open office layout, but I feel incredibly lonely. My colleagues have small cliques, and they eat lunch together and talk about private matters that I'm not part of. I try to join the conversation, but I always feel like an outsider. It's so draining to feel alone for 8 hours every day. Good advice is welcome.",
    "label": "Work, Study & Career"
  },
  {
    "title": "My girlfriend wants us to wear matching outfits",
    "selftext": "Hi Brevkasse.\nMy girlfriend (since 6 months) has started a new thing: she wants us to have matching clothes when we go out.\nNot just the same color, but sometimes exactly the same T-shirt.\nAt first it was a bit funny, but now she wants to do it every weekend.\nMy friends have started teasing me.\nHow do I say in a polite way that I would like to choose my own clothes, without making her sad?",
    "label": "Love & Dating"
  },
  {
    "title": "My parents are trying to become TikTok stars",
    "selftext": "Help! My parents (both 50+) have discovered TikTok, and now it's all wrong. They are making dance videos in the living room and trying to get me in them. Yesterday my dad made a video where he lip-synced to a song and used a filter that gave him cat ears. It's so embarrassing. They have asked me to 'teach them the new trends'. How do I survive this?",
    "label": "Family Dynamics"
  },
  {
    "title": "My boss uses Comic Sans for EVERYTHING",
    "selftext": "I started my first real student job, and it's fine enough, but my boss insists on using the Comic Sans font for everything. Official emails to customers, internal reports, presentations. EVERYTHING. It looks so unprofessional, and it drives me crazy. Can I say something, or should I just learn to live with it?",
    "label": "Work, Study & Career"
  },
  {
    "title": "How do you leave a group chat in a polite way?",
    "selftext": "I am part of a group chat from an old school project. The project ended several months ago, but the chat is still super active. There are 100+ messages a day with memes and idle chatter. It drains my battery and my patience. Can I just leave the group without saying anything, or is that rude? What do you write if you need to say something?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I always get hiccups from spicy food",
    "selftext": "This is a bit strange, but every single time I eat something that is just a little spicy – chili, strong mustard, even pepper – I get hiccups. Not just a few hiccups, but a long, annoying bout. My friends think it's really funny. Is there a scientific explanation for it, and is there something I can do to avoid it (besides eating bland food)?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "My roommate eats my food and denies it",
    "selftext": "I live in a dorm, and I'm pretty sure my roommate is eating my food. My Nutella jar empties faster, milk disappears, and yesterday a piece of my pizza from the previous evening was missing. When I ask him, he looks completely confused and says \"it wasn't me\". How do I handle this? Should I set a trap?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "Help, my houseplant is dying!",
    "selftext": "I bought my first houseplant to make my apartment cozier. It's a Pilea (a 'money plant'). I've followed all the instructions online: it doesn't get too much water, it sits in bright light, but not direct sunlight. Still, the leaves are drooping and look yellow and sad. What am I doing wrong? Is there a plant doctor here?",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People who block the entire sidewalk when they walk",
    "selftext": "Is there anything more irritating than a group of 3-4 people walking side by side at a snail's pace and filling the entire sidewalk? You can't get past them. You're forced to walk behind them at their pace or step onto the bike lane with your life on the line. Why don't people think about it? It's a small thing, but it ruins my morning every day.",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend is obsessed with his sourdough bread",
    "selftext": "During lockdown, my boyfriend started a sourdough starter. It was cozy at first. Now, two years later, it has taken over our lives. It has a name ('Børge'), it needs to be fed at precise times, and our entire kitchen table is covered in flour and strange tools. He talks more about rise times than about how my day has been. Is this normal?",
    "label": "Love & Dating"
  },
  {
    "title": "My little sister has 'borrowed' my clothes and posted them on Instagram",
    "selftext": "My 16‑year‑old little sister has been in my room while I was away and 'borrowed' my favorite dress. I found out because she posted a picture on Instagram of herself wearing it. She didn't ask permission, and now she has a stain on it. Our mother says I should 'be the adult'. But I'm furious! What should I do?",
    "label": "Family Dynamics"
  },
  {
    "title": "My friend wants me to help her cheat on the exam",
    "selftext": "My friend has asked if I would help her cheat on our upcoming online exam. She suggests that we sit together and do the assignment. I have read and prepared, but she hasn't. I don't want to cheat, and I'm afraid of being caught. But I'm also afraid of losing her as a friend if I say no. What should I say to her?",
    "label": "Work, Study & Career"
  },
  {
    "title": "My friend has become a vegan and comments on everything I eat",
    "selftext": "My good friend recently became a vegan, which is completely fine with me. The problem is that he now comments on everything I eat. If I order a burger, he says 'do you know how it's made?'. If I drink milk in my coffee, he gives a little lecture about the cow industry. It's so exhausting. How do I get him to stop without criticizing his choice?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "Is it weird that I'm afraid of balloons?",
    "selftext": "I have an irrational fear of balloons. The sound when they pop gives me a shock, and I can't relax at all if there are balloons in a room. It's a bit embarrassing, especially at birthdays. People always laugh at it, but for me it is truly uncomfortable. Are there others who feel the same, or am I the only one?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "How do you say no when friends ask if they can borrow money?",
    "selftext": "One of my friends asks quite often if he can borrow small amounts - 50 kr. here, 100 kr. there. He always pays back, but I'm just tired of being his personal ATM. It feels awkward to say no because they're not large amounts. How can I refuse in a way that doesn't ruin our friendship?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "What is the best way to remove a sticky price tag from a gift?",
    "selftext": "I bought a book as a gift, but I can't get the price tag off without it leaving a nasty, sticky residue or tearing the cover in pieces. I've tried peeling it off gently, but it always goes wrong. Is there a secret trick? Something with a hair dryer or oil? I need help before tomorrow!",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "Why can't people figure out how to use a supermarket checkout belt?",
    "selftext": "I go crazy in the supermarket. People pile their goods all the way up onto my shoulders, put their basket so you can't pass, and forget to put the product separator on the belt. It's as if common sense and consideration disappear as soon as people step into a Rema 1000. Is it really that hard?",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My date ate his food in a really strange way",
    "selftext": "I was on a date yesterday, which was otherwise really cozy. But he ate his burger in a very... special way. He separated it and ate each part separately: first the top bun, then the salad, then the patty, and finally the bottom bun. The same with the fries, which he ate with a knife and fork. Is that a dealbreaker? I can't help but think about it.",
    "label": "Love & Dating"
  },
  {
    "title": "My grandmother always gives me the same 50 kr. as a birthday present",
    "selftext": "Every year on my birthday I get a card from my grandmother with a 50-kroner bill inside. I am 24 now. I know she means well, and I love her, but it feels a bit funny. It's the same gift I got when I was 10. Should I just smile and say thanks, or can I politely suggest that she doesn't need to give me money?",
    "label": "Family Dynamics"
  },
  {
    "title": "I ended up 'liking' a 2015 photo on my crush's Instagram",
    "selftext": "I'm completely done. I was stalking my crush on Instagram and scrolled way back. Suddenly my thumb hit the 'like' button on a photo of him from a vacation in 2015. I removed my like right away, but he probably got a notification. Should I message and joke about it, or just pretend nothing happened and hope he didn't see it?",
    "label": "Love & Dating"
  },
  {
    "title": "My dad has started wearing crocs – everywhere",
    "selftext": "My dad has discovered crocs. And now they are the only footwear he wears. In the supermarket, at family birthdays, when he was with me at the recycling center. He has even asked if he can wear them to my cousin's confirmation. I feel a little ashamed about it. Can someone say something, or is it his feet, his choice?",
    "label": "Family Dynamics"
  },
  {
    "title": "I am afraid that I am the annoying one in my study group",
    "selftext": "We have just started a new study group, and I am afraid that the others think I am annoying. I might be asking too many questions, and I like that we have a clear plan. The others seem more relaxed. No one has said anything, but I get this feeling that they are a bit tired of me. Am I overreacting, or how can I find out?",
    "label": "Work, Study & Career"
  },
  {
    "title": "My friend never invites me over to her place",
    "selftext": "I have a really good friend, but we always meet at my place, at a café, or in town. I have never been at her place, even though we have been friends for over a year. Every time I suggest it, she comes up with an excuse that she's busy. I've started to wonder if there's a reason for that. Is it weird?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I don't like 'small talk'",
    "selftext": "I am really bad at small talk. At the hairdresser, during lunch breaks at work, at parties... I have no idea what to say about the weather or weekend plans. I'd rather talk about something deeper or just stay quiet. But people think I'm grumpy or arrogant. Do you have any good advice on how to get better at the superficial chatter that you can't avoid?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "Is it okay to use MobilePay to ask for 15 kr. back?",
    "selftext": "I paid for a cup of coffee for a friend yesterday. It was 15 kr. Is it too small to send a MobilePay request for that amount? I'm a student, so every penny counts, but I also don't want to seem stingy. Where is the line for when you ask for money back?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "How do you get rid of garlic smell from your fingers?",
    "selftext": "I love cooking with garlic, but I hate that the smell sticks to my fingers for several days. I've tried washing them with soap, lemon, and even toothpaste. Nothing really works. Is there a magic trick that can remove the garlic odor instantly?",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People who clap when the plane lands",
    "selftext": "I was flying last week, and when the plane landed safely, half of the passengers started clapping. Why? Do they also clap for the bus driver when he arrives at the stop? The pilot is just doing his job. I think it's so strange. Am I the only one who feels that way?",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend is terrible at losing in board games",
    "selftext": "I love playing board games, but my boyfriend is a real bad loser. If he's about to lose, he gets angry and grumpy and starts saying the game is stupid. It completely ruins the fun for me. I've tried talking to him about it, but he just says he has a 'competitive gene'. Should I just stop playing with him?",
    "label": "Love & Dating"
  },
  {
    "title": "My parents-in-law always give me socks as a gift",
    "selftext": "The last three years I've been getting socks from my parents-in-law for both Christmas and birthday gifts. Not special, cool socks, but just a gray 3-pack from the supermarket. I know you shouldn't be ungrateful, but it feels so impersonal. Is it a hint? Or are they just unimaginative? My girlfriend says I should let it go.",
    "label": "Family Dynamics"
  },
  {
    "title": "How do you handle a 'know-it-all' in the study group?",
    "selftext": "There is a guy in my study group who always thinks he knows best. He interrupts, corrects others, and explains things that everyone already knows. It's draining to listen to, and it creates a bad atmosphere because no one else dares to say anything. How can we politely get him to give space to the rest of us?",
    "label": "Work, Study & Career"
  },
  {
    "title": "My friend only replies to my messages with a 'thumbs up'",
    "selftext": "I have a friend who almost consistently replies to my messages with a 'thumbs up' emoji. Whether I write a long question, or share something personal, I just get a thumbs back. It feels so dismissive. Is it just me over-interpreting, or is it an impolite way of communicating?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "Can one become dependent on nasal spray?",
    "selftext": "I have been sick with a cold and used a nasal spray for a week. Now I am no longer sick, but my nose is still completely blocked unless I use the spray. I have heard that one can become dependent on it. Is that true? And how do I get out of it again? It's so annoying not being able to breathe properly.",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "My landlord wants me to mow the lawn",
    "selftext": "I rent a studio apartment with a small garden. There is nothing in my lease agreement stating that I must maintain the garden. Now my landlord has started sending me messages that the grass is too long and that I should mow it. Can he require that of me? I don't even have a lawn mower.",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "Which deodorant actually works against sweat odor?",
    "selftext": "I feel like I've tried all the deodorants on the market, but none of them work all day. In the afternoon I feel uncertain whether I smell of sweat. I need a 'heavy duty' deodorant that can keep me fresh from morning to evening. Do you have a recommendation that actually keeps what it promises?",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "I'm tired of ads that listen in",
    "selftext": "I am 100% sure that my phone is listening in on my conversations. Yesterday I was talking with a friend about cat food (I don't even have a cat), and now my entire Instagram feed is filled with ads for cat food. It's so creepy and intrusive. Is it legal? And is there anything one can do to stop it?",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend is at odds with my cat",
    "selftext": "I have a cat that I have had for several years. Half a year ago my boyfriend moved in, and he and the cat hate each other. The cat hisses at him and sometimes urinates in his shoes. My boyfriend ignores the cat or pushes it away. It's a terrible atmosphere at home. I love them both, what should I do?",
    "label": "Love & Dating"
  },
  {
    "title": "My mother always comments on my weight",
    "selftext": "Every time I see my mother, the first thing she says is something about my body. Either 'have you lost weight?' or 'you need to be careful not to gain weight'. It's always with a worried look. I am normal weight and feel fine with my body, but her comments make me insecure and sad. How do I get her to stop?",
    "label": "Family Dynamics"
  },
  {
    "title": "I am the only one in the office who doesn't drink alcohol",
    "selftext": "I don't drink alcohol at Friday bars and company parties. It's just a personal choice. But my colleagues keep pressuring me. 'Can't you just have one?', 'It's boring when you don't drink with us'. I'm tired of having to defend my choice all the time. How do you handle the social pressure?",
    "label": "Work, Study & Career"
  },
  {
    "title": "My friend copies my style",
    "selftext": "Lately, my friend has started copying me. She has bought the same jacket as me, dyed her hair in the same shade, and has even begun using the same phrases that I use. It's flattering, but also a bit creepy. I feel like I'm losing my own identity. Can I say something to her, or should I just let it be?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I get stomach pain from stress",
    "selftext": "During busy periods at school or work, I always get stomach pain. It's a crushing sensation, and sometimes I also feel nauseous. It's as if all my stress settles directly in my stomach. Are there others who experience this? And have you found anything that helps alleviate it?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "Is it dumb to spend money on an expensive fitness membership?",
    "selftext": "I am considering signing up for a slightly more expensive fitness center that has a spa and better classes.\nIt costs twice as much as my current cheap membership.\nMy sense says it's a waste of money, but I think I might get more out of it if it's a nicer place.\nWhat are your experiences? Is it worth the money?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "What is the best gift for an 18-year-old birthday?",
    "selftext": "My little brother is turning 18, and I have no idea what to give him. He wants money, but that's so boring. I would like to give him something more personal or an experience he can remember. The budget is around 500 DKK. Do you have any good ideas for the perfect gift for a young man stepping into the adult world?",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "Tourists who stop in the middle of Strøget to look at maps",
    "selftext": "I work close to Strøget, and every day it's the same battle. Families who suddenly stop in the middle of the crowd to unfold a huge city map or stare confused at their phone. Step aside, though! It creates a huge bottleneck and is a nuisance for everyone just trying to get through. Is it too much to ask for a little situational awareness?",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My crush only communicates in memes",
    "selftext": "I am texting with a guy I’m pretty into. He’s sweet and funny, but he almost exclusively replies with memes. If I ask how his day has been, he sends a picture of a tired cat. If I tell a joke, he sends a GIF. I can’t figure out whether he’s genuinely interested or just bored. How do you interpret meme language?",
    "label": "Love & Dating"
  },
  {
    "title": "My parents do not understand my need for privacy",
    "selftext": "I am 17 years old and live at home. My parents always come into my room without knocking. My mother has also 'organized' my drawers and read my diary. They say that as long as I live under their roof, they have the right to do so. But I feel that my boundaries are being completely crossed. Am I being unreasonable?",
    "label": "Family Dynamics"
  },
  {
    "title": "I am afraid to raise my hand in class",
    "selftext": "Even though I often know the answer, I never raise my hand in class. I am afraid of saying something wrong and of the other students thinking I'm dumb. So I just sit and stay quiet, even though I want to participate. It affects my oral grade. Does anyone have good advice on how to overcome this anxiety?",
    "label": "Work, Study & Career"
  },
  {
    "title": "Is it okay to ghost a friend?",
    "selftext": "I have an acquaintance whom I've seen a few times. He's decent enough, but we have no chemistry at all, and I don't want to see him anymore. He keeps writing and inviting me out. Is it okay just to stop replying to him? Or do I owe him an explanation, even though we're not close friends? I hate confrontations.",
    "label": "Friendship & Social Life"
  },
  {
    "title": "My fingers 'sleep' all the time",
    "selftext": "Recently, my fingers (especially the little finger and ring finger) have started to 'sleep' quite often. It happens when I hold my phone, cycle, or sometimes just wake up in the morning. It's a tingling and numb sensation. Should I be concerned and see a doctor, or is it just a normal thing?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "How do you save when you're bad at it?",
    "selftext": "I really want to save up for a trip, but I'm terrible at it. Every time I get paid, it feels like the money just disappears on small things like coffee, lunch out, and impulse purchases. I've tried making a budget, but I never stick to it. Do you have a foolproof trick for someone who lacks financial discipline?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "What is the best way to boil an egg?",
    "selftext": "It sounds like a simple question, but I can never get it perfect. Either it's overcooked, or the yolk is completely runny. What is the secret behind the perfect smiling egg? How many minutes should it have? Should it be in cold or boiling water from the start? All tips are welcome!",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "Why do people leave their chewing gum under tables?",
    "selftext": "I ended up touching the underside of a table at a café today, and my hand was covered with an old, hard piece of chewing gum. It's so disgusting! Who does that? We're supposed to be taught to wrap it in a piece of paper and throw it in the trash can. It's the height of disrespect.",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend doesn't like my friends",
    "selftext": "I have been with my boyfriend for a year, and he makes no effort to get to know my friends. When we are together with them, he just sits and looks at his phone. Afterwards he says that he thinks they are superficial. My friends are a huge part of my life. That can't work in the long run if he doesn't like them?",
    "label": "Love & Dating"
  },
  {
    "title": "My brother thinks he's an expert in everything",
    "selftext": "My older brother just read half an article online, and suddenly he's an expert on the subject. Whether it's politics, investing, or diet, he knows best. He lectures the whole family and refuses to listen to others. It's so exhausting to be at family gatherings. How do you deal with someone who is so arrogant?",
    "label": "Family Dynamics"
  },
  {
    "title": "I hate group work",
    "selftext": "I learn best when I work alone. But at my university almost everything is based on group work. I always end up doing most of the work because the others are irresponsible. Or there are endless discussions about trivial matters. Can I ask my instructor to do the assignment alone, or should I just accept that it is part of studying?",
    "label": "Work, Study & Career"
  },
  {
    "title": "My friend is a 'one-upper'",
    "selftext": "I have a friend who always has to outdo everything I tell. If I say I've had a busy week, he has had a MUCH busier week. If I tell him I've bought a new phone, he just ordered one that is much better. It's so exhausting that it always has to be a competition. Is that something you can talk to him about?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I always sneeze when I look toward the sun",
    "selftext": "Every time I go outside, and the sun is shining, I start sneezing. Usually 2-3 times in a row. My family experiences it the same way. Is it some kind of allergy? It's quite inconvenient, especially when driving. I've heard it's hereditary, but is there a real explanation?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "Is it rude to ask guests to take off their shoes?",
    "selftext": "I would prefer not to have shoes inside, especially not in wet weather. But I find it awkward to ask guests to take their shoes off. Especially if they have put a lot of effort into their outfit. What is the general attitude in Denmark? Is it common courtesy to take them off, or is it the host's responsibility to accept shoes inside?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "How do you get a zipper that is stuck to work again?",
    "selftext": "The zipper on my favorite jacket has gotten stuck. It won't go up or down. I've tried pulling gently, but I'm afraid of breaking it. Is there a trick to 'lubricate' it so it slides again? I've heard something about using a pencil. Does that work?",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People who don't put their weights back in the gym",
    "selftext": "I am so tired of people in the gym who use a lot of heavy weight plates and then just leave them on the bar or on the floor. It's bad manners and disrespectful to the next people who need to use the equipment. It takes two minutes to clean up after yourself. How hard can it be?",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend is friends with his ex on social media",
    "selftext": "I have discovered that my boyfriend still follows his ex on Instagram. He also likes her pictures from time to time. He says they ended on good terms, and that it doesn't mean anything. But I can't help feeling a sting of jealousy. Is it me who is insecure, or is it okay to ask him to remove her?",
    "label": "Love & Dating"
  },
  {
    "title": "My parents still want to control my finances",
    "selftext": "I am 22 years old, have moved out of the house and have a job. Still, my parents want access to my online banking to \"keep an eye on me using my money wisely.\" They interfere with my purchases and criticize me if I spend money on clothes or café visits. How do I set a boundary without seeming ungrateful for their help in the past?",
    "label": "Family Dynamics"
  },
  {
    "title": "How do you write a good application for a part-time job?",
    "selftext": "I am 16 years old and would like to get my first part-time job at a supermarket or a café. But I have no idea what to write in an application when I have no experience. What do employers look for? Should I just write that I am punctual and eager to learn? All tips are welcome!",
    "label": "Work, Study & Career"
  },
  {
    "title": "I am the only one in the friend group who doesn't have a driver's license",
    "selftext": "All my friends have gotten driver's licenses and cars. Now all their plans revolve around driving trips, and I feel a bit left out. I am the one who always has to ask if I can ride along, and I can't join the spontaneous trips. I can't afford a driver's license right now. How do you handle the feeling of being left behind?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I have social anxiety about talking on the phone",
    "selftext": "I hate talking on the phone with people I don't know. If I have to call the doctor or order a pizza, I get a racing heart and practice what I'm going to say several times. I always postpone it and end up writing an email if possible. It's so impractical. Is there anyone who has overcome phone anxiety?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "Should I choose a fixed or variable interest rate on my SU loan?",
    "selftext": "I am going to take an SU loan to get everything running. But I am unsure whether I should choose a fixed or variable interest rate. I know nothing about finance. What are the advantages and disadvantages of the two? What would you choose if you were me?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "What is the best remedy against mosquitoes?",
    "selftext": "I get bitten alive by mosquitoes every summer. I get huge, itchy bites that drive me mad. I've tried mosquito spray and those plugs you put in the outlet, but nothing works 100%. What are your best, most effective weapons in the war against mosquitoes?",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People who use their phones in the cinema",
    "selftext": "There is nothing that can ruin a movie experience like the light from a mobile screen. Even though people dim the brightness, it is still incredibly disruptive in the dark. Why can't you put the phone away for two hours? It's so disrespectful to everyone else in the theater.",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend hates my favorite movie",
    "selftext": "My absolute favorite movie is [insert fictional movie title], and I tried to show it to my boyfriend. He fell asleep halfway and later said it was the most boring movie he had ever seen. I know it's a small thing, but I was genuinely upset. Can you have a relationship with someone who has such bad taste in movies?",
    "label": "Love & Dating"
  },
  {
    "title": "My parents forgot my birthday",
    "selftext": "I turned 20 yesterday. My friends celebrated me, but I heard nothing from my parents. No call, no message, no card. They've never forgotten it before. I'm hurt and disappointed, but I don't know whether I should say something to them. Should I call and remind them, or just see how long it takes before they notice?",
    "label": "Family Dynamics"
  },
  {
    "title": "Is it too late to change study track in high school?",
    "selftext": "I am in 2.g and have realized that I have chosen the completely wrong study track. I hate my subjects, and I can't see myself using it for anything. Is it possible to switch to another line now, or am I forced to continue and then just supplement subjects later? I am quite unhappy about it.",
    "label": "Work, Study & Career"
  },
  {
    "title": "My friend is passing on my secrets",
    "selftext": "I have told my friend something personal in confidence. Now I have heard from another friend that she has passed it on. I feel so betrayed and can no longer trust her. Should I confront her about it, or should I just let the friendship die out and stop telling her things?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I sweat a lot, even though it's not hot",
    "selftext": "Even when I'm just sitting still in a cool room, I can start to sweat.\nIt's especially on my back and in my palms.\nIt's embarrassing, and I'm always worried about whether I smell, or whether it can be seen on my clothes.\nIs there anyone who has experienced the same and found a solution?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "I found 500 kr. on the street. What should I do?",
    "selftext": "I found a 500-kr bill lying and fluttering on the sidewalk. There was no one nearby, and no wallet or anything. What is the right thing to do? Should I hand it over to the police as found property, or can I just keep it? What would you do?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "What do you do about a bicycle chain that keeps falling off?",
    "selftext": "My bike chain falls off at least once a week. It's always at the most annoying time, and I end up getting oil all over it. I've tried tightening it, but it doesn't seem to help. Is there a simple trick, or should I just send it to an expensive bike mechanic?",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People who stand in front of you in the bus queue",
    "selftext": "Someone has been standing politely and waiting for the bus.\nThen the bus arrives, the doors open, and suddenly a person who has just arrived pushes themselves in front of everyone else to get in first.\nWhere has politeness gone?\nIt's so disrespectful to those who have been standing and waiting.\nAm I the only one who gets angry about it?",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend is a vegetarian, and I love meat",
    "selftext": "I just got a boyfriend who is a vegetarian. I eat meat and really enjoy it. Right now it's not a problem, but I'm worried about the future. How can we make it work in everyday cooking? Should we make two different dishes each evening? Are there other couples here with the same 'problem'?",
    "label": "Love & Dating"
  },
  {
    "title": "Should I force my child to give hugs to family members?",
    "selftext": "My 4-year-old daughter doesn't always want to give hugs to grandparents or other family members when we say goodbye. My mother gets offended and says that I should teach her to be polite. But I also want to teach my daughter that she decides for herself over her body. What is the right thing to do here?",
    "label": "Family Dynamics"
  },
  {
    "title": "I am unsure about what to do after high school",
    "selftext": "I am graduating this summer and everyone asks what I will do afterwards. The truth is, I have no idea. I don't want to start a course immediately. Is it okay to take a gap year and just work and figure out what I want? I feel huge pressure to have a plan.",
    "label": "Work, Study & Career"
  },
  {
    "title": "I am always the one who writes first",
    "selftext": "In my friend group, it's always me who has to take the initiative. If I don't write in our group chat and suggest that we meet up, nothing happens. I get a bit tired of always having to be the one who gathers the troops. Does that mean they are not as interested in seeing me as I am in seeing them?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I can't sleep without 'white noise'",
    "selftext": "I have become dependent on sleeping with an app that plays 'white noise' (rain sounds, wind, etc.). If I don't have it on, I wake up at the slightest sound. Is it unhealthy for my ears to listen to it all night? And how can I get rid of it again?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "Is it a bad idea to buy a sofa on installment?",
    "selftext": "I have found my dream sofa, but it is quite expensive. The store offers the option to buy it on interest‑free installments over 24 months. It sounds tempting, but I have also heard that such loans can be a trap. What are your experiences? Is it a good way to afford something you want, or is it a foolish financial decision?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "Good ideas for a lunchbox that isn't boring?",
    "selftext": "I am so tired of my dry rye bread sandwiches. I need inspiration for a lunchbox that is actually exciting to eat for lunch. It should be easy to make, and it must not require a microwave. What do you have in your lunchboxes? Share your best ideas!",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "Cyclists who run red lights",
    "selftext": "I am a cyclist myself, and I get so irritated with other cyclists who just run red lights. It is dangerous for them, for pedestrians, and for motorists. And it gives all of us other cyclists a bad reputation. How hard can it be to stop at a red light? It takes 30 seconds.",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend is a bad driver",
    "selftext": "I love my boyfriend, but I'm afraid to drive with him. He drives too fast, brakes too late, and gets angry at others on the road. I always sit with my heart pounding in my chest. I've tried telling him, but he just gets offended and says he has full control. What should I do?",
    "label": "Love & Dating"
  },
  {
    "title": "My grandma calls 10 times a day",
    "selftext": "My grandma is 85 and lives alone. She calls me constantly throughout the day, often just to ask the same thing she asked an hour ago. I love her, but I can't answer the phone when I'm at school or work. I feel guilty when I don't pick up. How do you handle that?",
    "label": "Family Dynamics"
  },
  {
    "title": "My internship supervisor gives me no tasks",
    "selftext": "I am in an internship, and I am terribly bored. My supervisor is nice, but she forgets to give me tasks. I just sit and stare at a screen most of the day. I have asked if there is anything I can help with, but she just says 'not right now'. I am learning nothing. What should I do?",
    "label": "Work, Study & Career"
  },
  {
    "title": "A friend has stopped inviting me to things",
    "selftext": "I have a friend whom I used to see a lot. But in the last six months he hasn't invited me to anything. I can see on social media that he still hosts parties and hangs out with our mutual friends. I asked if everything is okay, and he says 'yes, of course'. But something has changed. Should I just let it go, or should I ask more directly?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "Why do my nails keep breaking?",
    "selftext": "My nails have become really weak.\nThey split and break as soon as they get a little length.\nI eat healthy and use hand cream.\nIs this a sign that I am missing vitamins?\nOr is there a miracle cure in the form of a nail polish or oil that can make them stronger?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "My neighbor smokes, and the smell seeps into my apartment",
    "selftext": "My downstairs neighbor smokes inside, and the smoke seeps up through the floor into my apartment. The whole living room smells of old smoke. It's especially bad in the evening. I don't want to create a bad atmosphere. How do I bring up the conversation with him in a polite way? Is it even possible to ask people not to smoke in their own home?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "How do you prevent your glasses from fogging up when wearing a mask?",
    "selftext": "Although masks are no longer required in most places, I still use them on public transport. But my glasses fog up immediately, and I can't see anything. I've tried placing the mask in different ways and putting it under the glasses. Nothing works. Do you have a trick that actually prevents it?",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "Why do shop staff say 'have a good day'?",
    "selftext": "I’ve noticed that almost all shop staff say 'have a good day' when you leave. Why not just say 'good day'? The word 'have' implies that I already had a good day, but what if I had a terrible day? It’s a small, silly thing, but it irritates me every time.",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend talks in his sleep about penguins",
    "selftext": "My boyfriend has started talking in his sleep. It's not just mumbling; it's full sentences. The problem is that it's always about penguins. Last night he said: 'No, Klaus, give that fish back to the emperor!'. I know it's harmless, but it's also really weird. I've tried asking him about it, but he can't remember anything. Is it normal to have such specific sleep topics?",
    "label": "Love & Dating"
  },
  {
    "title": "My mom has added all my friends on Snapchat",
    "selftext": "Help. My mom (48) got Snapchat to 'keep up with the young world'. It was fine until I discovered that she had found and added all my closest friends. Now she sends them pictures of her garden with a flower-crown filter and writes 'Good morning, beautiful young people'. My friends think it's a bit funny, but I'm dying of embarrassment. How do I ask her to stop?",
    "label": "Family Dynamics"
  },
  {
    "title": "My colleague in the bakery is eating the cakes",
    "selftext": "I have a part-time job at a bakery. My colleague has a bad habit of 'tasting' the goods. A small piece of a raspberry roll here, a mouthful of a spandauer there. The boss hasn't noticed it, but I see it all the time. Technically, it's theft. Should I tell the boss, confront my colleague, or just pretend nothing happened? I don't want to be a snitch.",
    "label": "Work, Study & Career"
  },
  {
    "title": "Feeling like the only one who doesn't get an inside joke",
    "selftext": "In my friend group they have an inside joke about 'a Tuesday in Randers'. Every time someone mentions it, they all burst out laughing. I wasn't there when it happened, and no one will explain to me what's so funny. They just say 'it can't be explained'. I feel totally left out when it happens. Is that bad manners on their part?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I am afraid of swallowing chewing gum",
    "selftext": "Since I was little, I have had panic anxiety about swallowing my chewing gum. I have heard that story that it stays in the stomach for seven years. I know it probably isn't true, but the fear still lingers in me. If I am about to swallow it accidentally, I go into full panic. Are there others who have strange childhood fears that still cling on?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "My roommate has labeled everything in the fridge with his name",
    "selftext": "I just moved into a college room with a new roommate. Yesterday I discovered that he has put small labels with his name on everything he owns in the fridge. The milk, the cheese, a half onion in a bag. Everything. It feels extremely passive-aggressive, as if he expects me to steal his food. Should I just ignore it, or should I make a joke out of it and put a name tag on my own cucumber?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "How to open a stubborn jam jar?",
    "selftext": "This is a cry for help. I'm standing here about to make pancakes, but I simply can't get the lid off the strawberry jam. I've tried with a damp cloth, banging it against the edge of the table, and holding it under the hot tap. The lid won't budge. Is there a secret trick that everyone knows except me? My breakfast depends on it!",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People who don't remove their lint from the dryer filter",
    "selftext": "I live in a property with a shared laundry room. Every time I need to use the dryer, the filter is filled with a thick layer of someone else's lint and hair. It's so disgusting, and it takes 10 seconds to remove. Why are people so indifferent to shared spaces? It's laziness at its finest.",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "Date used a gift card on our first dinner",
    "selftext": "I was on a first date yesterday.\nThe mood was good, and he was really sweet.\nBut when we had to pay, he pulled out a gift card that he had received as a Christmas present.\nI was a little taken aback.\nIsn't it a weird style to use a gift card on a first date?\nI can't figure out whether it's frugal and smart, or just really tacky.\nWhat do you think?",
    "label": "Love & Dating"
  },
  {
    "title": "My dad insists on fixing everything himself (and makes it worse)",
    "selftext": "My dad is convinced that he's a handyman. The problem is that he isn't. Every time something breaks at home – a dripping faucet, a creaky door – he throws himself at it with his tools. The result is almost always that the problem gets worse. The dripping faucet is now a gushing faucet. How do you convince him that it's okay to call a professional?",
    "label": "Family Dynamics"
  },
  {
    "title": "My teacher uses too many internal jokes that I don't get",
    "selftext": "My history teacher is probably a nice guy, but half of his teaching consists of internal jokes and references to old Monty Python movies. A few people in the class laugh loudly, while the rest of us just sit and look confused. It's hard to concentrate on the lesson when you feel like you've missed the point. Can I say something to him about it?",
    "label": "Work, Study & Career"
  },
  {
    "title": "My friend has become obsessed with crystals",
    "selftext": "My best friend has started to get very into crystals and astrology. It's fine, but now it's the only thing she talks about. If I have a bad day, she says it's because 'Mercury is in retrograde', and that I should 'cleanse my energy with rose quartz'. I miss talking about normal things. How do I support her without going crazy myself?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "Is it normal to be afraid of going down into the basement alone?",
    "selftext": "I am 17 years old, but I am still afraid of going down into our basement alone. Especially in the evenings. I turn on all the lights, run down to get what I need, and sprint back up the stairs. I know there's nothing there, but I still get this creepy feeling. Is it childish, or are there others who feel the same way about basements?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "I have spent too much money on skins in an online game",
    "selftext": "I have ended up spending almost all my pocket money this month on buying skins and other items in Fortnite. At the moment it felt like a good idea, but now I regret it and can't afford to go to the cinema with my friends. I am ashamed to tell my parents. Do you have any advice on how to manage your spending in games?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "What is the best trick to remember people's names?",
    "selftext": "I am terrible at remembering names. At parties or at the start of a new school year I am introduced to a lot of people, and two minutes later all the names have disappeared from my brain. It is so embarrassing when I meet them again. Do you have any clever memory rules or tricks that work?",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "Why do recipes on the internet have to start with a whole novel?",
    "selftext": "I just want to know how long a chicken should be in the oven. Why do I have to first read a whole blog post about the author's childhood memories from a summer in Provence, and how the recipe has been in the family for generations? Just give me the recipe! There should be a 'jump to recipe' button on all food blogs.",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend is extremely picky and only eats food without 'clumps'",
    "selftext": "My boyfriend is the sweetest in the world, but he is extremely picky. He only eats food that has a uniform consistency. Stews, lasagna with meat sauce, fruit yogurt - everything with 'clumps' is excluded. He practically lives off pasta with ketchup and chicken nuggets. It's starting to get a bit boring to cook. Can you teach an adult man to eat normally?",
    "label": "Love & Dating"
  },
  {
    "title": "My parents are embarrassing on social media",
    "selftext": "My parents comment on everything I post on Instagram. My mom writes things like 'My beautiful girl!' with 10 heart emojis, and my dad writes 'Nice picture. Say hi to cousin Lars'. They also comment on my friends' pictures. It's meant to be sweet, but it's also very embarrassing. How do I get them to stop without hurting their feelings?",
    "label": "Family Dynamics"
  },
  {
    "title": "My classmate smells of smoke",
    "selftext": "I have a new classmate in the class. He's pretty nice, but he smokes in all the breaks, and when he comes back in, his clothes and breath smell strongly of smoke. I almost get a headache from it. Can I say something to him in a polite way, or is it too sensitive a topic? I don't want to create a bad atmosphere.",
    "label": "Work, Study & Career"
  },
  {
    "title": "My friends are making a group chat without me",
    "selftext": "I have discovered that my closest friends have a separate group chat where I am not included. I happened to see it on one of their phones. I feel so hurt and left out. Why would they do that? Should I confront them about it, or should I just pretend nothing and be sad in secret?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I am the tallest girl in my class, and I hate it",
    "selftext": "I am a 15-year-old girl and almost 1.85 m tall. I am taller than all the girls and most of the boys in my class. I feel like a giant, and I always wear flat shoes so as not to appear even taller. People always comment on it. How do you learn to accept your height and be proud of it?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "My friends want to go to an expensive festival, but I can't afford it",
    "selftext": "All my friends are planning to go to Roskilde Festival this summer. They don't talk about anything else. I really want to go, but I simply can't afford the ticket. I'm embarrassed to say it, because it seems like everyone else has their finances under control. What should I do? Should I just tell the truth or come up with a bad excuse?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "How to avoid static clothing in winter?",
    "selftext": "Every winter I have the same problem. My clothes become static, so they stick to me and give me small shocks. Especially my scarf makes my hair completely electric. Is there a smart trick to avoid it? Something you can put in the washing machine or a special spray?",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People standing in the way right in front of the exit on the train",
    "selftext": "When the train approaches the station, there is always a group of people who stand up and pile up against the doors, even though they are not supposed to get off. This makes it impossible for those of us who actually need to get off to exit. Why can't we wait for our turn until the train has stopped and people have gotten out? It's poor logistics and poor etiquette.",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend hates my music taste",
    "selftext": "Every time I play my favorite playlist in the car, my boyfriend groans and asks if we could listen to something else. He calls my music \"depressing indie noise\". I love him, but it hurts me that he is so dismissive about something that means a lot to me. Can you ask your boyfriend to stop criticizing your music taste?",
    "label": "Love & Dating"
  },
  {
    "title": "My grandparents don't understand what a 'meme' is",
    "selftext": "I tried to show my grandmother a funny meme on my phone. She stared at it for a minute and then asked: 'Who is that cat, and why is it angry?'. I tried to explain the concept, but it only made it more confusing for her. Now she sends me pictures of random animals with the text 'Is this a meme?'. It's cute, but also a bit exhausting.",
    "label": "Family Dynamics"
  },
  {
    "title": "My boss is my friend's mom, and it's awkward",
    "selftext": "I have gotten a part‑time job at a store where the boss is the mother of one of my good friends. It's so awkward. She treats me a bit like her own child and asks about my private life. And I don't dare say no to her, because I'm afraid it will affect my friendship. Is it a bad idea to work for your friends' parents?",
    "label": "Work, Study & Career"
  },
  {
    "title": "My best friend has become a couple with my twin brother",
    "selftext": "My best friend and my twin brother have just become a couple. It's so weird. Now she's at all our family parties, and they are together all the time. I'm happy for them, but I also feel like I've lost both my friend and my brother a little bit. Is it normal to feel like that?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I am afraid of talking on the phone with strangers",
    "selftext": "I hate having to call places. The doctor, the hairdresser, the pizza guy.\nI get a racing heart, and I practice what I'm going to say before I call.\nI always prefer online booking if possible.\nIt feels like irrational anxiety, but it is very real for me.\nIs there anyone who has felt the same way and gotten over it?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "I have lost my wallet - what should I do?",
    "selftext": "I think I lost my wallet somewhere in the city today. All my cards are in it – Dankort, travel card, student card. What is the first thing I should do? Should I block all cards immediately? And is there any chance of getting it back if I report it missing to the police?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "How do you keep your headphone cables from tangling?",
    "selftext": "Regardless of how neatly I roll the cable of my headphones together, it always ends up as a completely impossible knot when I take it out of my pocket or bag. I spend several minutes every day untangling it. Is there a magical trick to avoid it? It drives me mad.",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "I don't understand people who like licorice",
    "selftext": "Honestly, how can someone like the taste of licorice? Especially salty licorice. For me it tastes like a mix of salt and chemicals. Still, most Danes love it. I feel like an alien every time someone offers Piratos. Am I the only one in the country who thinks it's a terrible taste?",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend is bad at replying to messages, but is always online",
    "selftext": "My boyfriend can take hours to reply to a simple message from me. But I can see on Snapchat and Instagram that he is online and active. That makes me insecure and irritated. Why can he see stories but not reply to my question? I have mentioned it to him, but he just says that he 'doesn't have the energy' to reply. Is that a bad excuse?",
    "label": "Love & Dating"
  },
  {
    "title": "My uncle tells the same bad joke at every family gathering",
    "selftext": "Every. Only. Time.\nWe are gathered as a family, my uncle stands up and tells the same joke about a Norwegian, a Swede and a Dane. It wasn't even funny the first time.\nWe others send tired looks to each other, while he himself laughs loudly. Should we just let him do it, or can we politely say 'Uncle Børge, we've heard that one'?",
    "label": "Family Dynamics"
  },
  {
    "title": "I am the only one who doesn't understand math in my class",
    "selftext": "It feels like everyone else in my math class gets it right away. The teacher explains, and they nod. I just sit and feel dumber and dumber. I don't dare ask questions, because I'm afraid the others will think it's a dumb question. Is there anyone who has good advice on how to get better at math when you feel completely lost?",
    "label": "Work, Study & Career"
  },
  {
    "title": "My friend has started hanging out with a 'bad' clique",
    "selftext": "My best friend has started spending a lot of time with a group from school that has a pretty bad reputation. They cheat, smoke, and are generally pretty indifferent to everything. She has started to change and often cancels our plans to be with them. I'm worried about her, but I'm afraid she'll get mad if I say something. What should I do?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I eat when I'm bored",
    "selftext": "As soon as I get bored or just sit and watch a series, I automatically go to the kitchen to find something to eat. Even if I'm not hungry. It's just a bad habit that I want to stop. Do you have any good advice to avoid 'boredom eating'?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "My parents don't give me pocket money",
    "selftext": "I am 15 years old, and my parents don't think I should have regular pocket money. They say they pay for everything I need. But I want my own money so I can decide what I want to spend it on, without having to ask permission to buy a soda. Is it unreasonable to expect pocket money?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "I have to give a speech for the first time - help!",
    "selftext": "I have to give a speech for my friend's confirmation, and I'm starting to panic. I'm not used to speaking in front of many people. What should I talk about? How does one structure a good speech? And what do you do if you freeze or start shaking? All tips for a nervous first-time speaker are welcome.",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "I hate the sound of people cutting nails",
    "selftext": "Is there a sound that is worse than the little 'click' sound of a nail clipper? It gives me goosebumps. And it's even worse when people do it in public places like on the train or on a bench in the park. Why can't you do that kind of thing privately in your own bathroom? It's so disgusting.",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "Feeling pressured to say 'I love you' first",
    "selftext": "I've been dating a guy for a couple of months, and I'm really happy with him. I can feel that he's close to saying those three little words, and I feel pressure to be ready to say them back. But I'm not quite there yet. What do you do if one is ready before the other? I don't want to hurt him by staying silent.",
    "label": "Love & Dating"
  },
  {
    "title": "My sister and I have to share a room, and she is super messy",
    "selftext": "My parents have decided that my little sister and I have to share a room to make space for a home office. I'm okay with sharing, but she is the messiest person in the world. Her clothes are everywhere, and she leaves plates on her desk. I'm very tidy. How can we make it work without becoming enemies every day?",
    "label": "Family Dynamics"
  },
  {
    "title": "I am afraid to quit my part-time job",
    "selftext": "I have had a part-time job at a supermarket for a year, but now I want to stop so I can focus more on school. The problem is that I am afraid to quit. My boss is really nice, and I am afraid of disappointing her. What do you say? Should I say it in person, or is it okay to send an email?",
    "label": "Work, Study & Career"
  },
  {
    "title": "Two of my friends have become enemies, and I am stuck in the middle",
    "selftext": "My two best friends have become bitter enemies over a small thing. Now they refuse to be in the same room, and they both try to get me to pick a side. They speak badly about each other to me. It's a terrible situation. How can I be friends with both of them without being drawn into their conflict?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I got glasses and feel ugly with them",
    "selftext": "I just found out from the optician that I need glasses. I got them now, and I hate how I look with them. I feel nerdy and not like myself at all. Everyone says they are pretty, but I just think they're polite. How do you get used to having glasses and feel pretty again?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "I ended up ruining something expensive that I borrowed from a friend",
    "selftext": "I borrowed a pretty expensive jacket from a friend for a party. During the evening I ended up spilling something on it, which has left a permanent stain. I am so embarrassed and upset. Should I offer to pay for a new jacket? I really can't afford it. How do you handle such a situation in the best possible way?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "How do you prevent bananas from turning brown too quickly?",
    "selftext": "I love bananas, but I find that they turn brown and overripe almost immediately after I buy them. I've heard all sorts of tricks – that you should separate them, wrap the stem in film, etc. What actually works? What is the best way to store bananas so they stay fresh longer?",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "Why does soda taste better from a glass bottle?",
    "selftext": "Is it just me, or does a Coca-Cola taste significantly better when it comes from a cold glass bottle compared to a plastic bottle or a can? There must be a scientific explanation. Is it something about the carbonation or the material? I can't be the only one who has thought about it.",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My date checked her phone the whole time during the movie in the cinema",
    "selftext": "I was at the cinema with a girl yesterday. Midway through the movie she pulls out her phone and starts scrolling on Instagram. Not just a quick glance, but for several minutes at a time. The light from the screen was wildly distracting, and I thought it was so disrespectful. Is that a reason not to go on another date?",
    "label": "Love & Dating"
  },
  {
    "title": "My mother has become obsessed with genealogy and wants my DNA",
    "selftext": "My mother has gone all-in on genealogy. She has bought one of those DNA test kits, and now she wants me to take a test too so she can 'map the entire family's genetic origins'. I really don't feel like sending my DNA to a private company. She keeps pressing. Is it weird for me to say no?",
    "label": "Family Dynamics"
  },
  {
    "title": "My teacher is giving preferential treatment",
    "selftext": "There are a few students in my class whom my teacher apparently likes better than the rest of us. They always get more speaking time, receive praise for the smallest things, and are allowed to submit late. It's so obvious and unfair. It demotivates me completely. Can you do something about it, or should you just accept it?",
    "label": "Work, Study & Career"
  },
  {
    "title": "I am secretly in love with my best friend",
    "selftext": "I am a girl and deeply in love with my best friend, who is a guy. We have known each other forever, and we can talk about everything. I am so scared to tell him that, because what if he doesn't feel the same? I don't want to risk ruining our friendship. But it's also hard to act like nothing when he talks about other girls. What should I do?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I compare myself too much with others on social media",
    "selftext": "When I scroll through Instagram, I always feel worse afterwards. Everyone else seems to have a perfect life, be prettier, travel more, and have more friends. I know it's a glossy picture, but I can't help comparing myself. Do you have any advice on how to stop this bad habit?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "My friend owes me money and acts like nothing",
    "selftext": "I lent a friend 200 kr. a month ago. He said he would pay back 'soon'. Now I've seen that he has bought new sneakers and dined out several times. He hasn't mentioned the money at all. It's awkward to ask for it, but I also think it's bad manners on his part. How do you ask in a relaxed way?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "I have locked myself out of my apartment. What now?",
    "selftext": "I ended up slamming the door, and my keys are inside. My phone is also inside (I'm writing from my computer at a cafe). My landlord doesn't have his phone. Should I call a locksmith? I've heard they're super expensive. Are there other cheaper solutions? I'm a bit panicked.",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "I'm tired of getting ads for things I've just talked about",
    "selftext": "It's so creepy. I'm talking with a friend about going on a ski trip, and five minutes later my Facebook feed is filled with ads for ski trips and ski gear. My phone must be listening in. There's no other explanation. It feels like a huge violation of my privacy. Is it just me?",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend is obsessed with a YouTuber",
    "selftext": "My boyfriend watches videos with the same YouTuber for hours every day. He constantly quotes him, has bought his merchandise, and talks about him as if they were best friends. At first it was fine, but now I'm starting to go crazy from hearing about a person I've never met. Is it normal to be such a big fan of an online personality?",
    "label": "Love & Dating"
  },
  {
    "title": "The whole family has to wear matching ugly Christmas sweaters on Christmas Eve",
    "selftext": "My mom has decided that this year's Christmas theme is 'coziness and humor'. Therefore she bought matching Christmas sweaters for the whole family – they are green with a singing moose that has blinking lights in its antlers. I am 17, and I refuse to wear it. She says I'm ruining the good mood. Am I the grumpy teenager, or is it reasonable to refuse?",
    "label": "Family Dynamics"
  },
  {
    "title": "I fell asleep in an online class. Did the teacher notice?",
    "selftext": "We had online lessons this morning, and I was so tired. I ended up falling asleep for about 20 minutes. My camera was on. I woke up with a start. Do you think the teacher or the others in the class noticed? I'm so embarrassed. Should I apologize, or just hope no one saw anything?",
    "label": "Work, Study & Career"
  },
  {
    "title": "My friend posts embarrassing pictures of me from when we were kids",
    "selftext": "My childhood friend has started a new trend where every Thursday ('Throwback Thursday') he posts an old, embarrassing picture of me on Instagram and tags me. Pictures where I have weird clothes on, missing teeth, or a crooked hairstyle. He thinks it's funny. I think it's terrible. How do I get him to stop?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I have a bad habit of picking at my skin",
    "selftext": "When I am nervous or bored, I unconsciously start picking at the skin on my fingers, especially around the nails. Sometimes I pick until it bleeds, and it doesn't look nice. I really want to stop, but I do it without thinking about it. Is there anyone who has had the same bad habit and found a way to stop?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "Is it worth the money to buy organic?",
    "selftext": "I want to live healthier, but organic goods are much more expensive than conventional ones. Does it really make a big difference for one's health to buy organic carrots and milk? Or is it mostly for the sake of the environment? I'm a student, so the budget is tight.",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "Tips for keeping your room tidy when you're a messy person",
    "selftext": "I am a chronic messy person. My room is always a chaos of clothes, books, and random things. I clean up, and two days later it looks like a war zone again. I would love to be one of the people who have a neat and tidy room. Do you have any simple habits or systems that can help a person like me?",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "I hate it when people misuse 'i forhold til'",
    "selftext": "It is one of my pet peeves. People who start every sentence with 'i forhold til...'. 'In relation to the weather, it is good'. 'In relation to the food, it tastes fine'. It's linguistically lazy and often misused. You could just say 'The weather is good'. Am I the only language nerd who gets irritated by it?",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "How do you break up with someone who is *too* sweet?",
    "selftext": "I have a boyfriend who is the sweetest person in the world. He does everything for me, is always considerate, and has no bad sides. The problem is that I just don't have feelings for him anymore. I feel like the worst person in the world. How do you break up with someone who hasn't done anything wrong? I know it will break him.",
    "label": "Love & Dating"
  },
  {
    "title": "My stepdad is trying too hard to be my friend",
    "selftext": "My mom has a new boyfriend, and he's pretty nice. But he really tries too hard to be my friend. He wants to 'hang out', uses slang that he thinks is cool, and wants to listen to the same music as me. It feels so awkward and forced. I'd rather just have him be my mom's boyfriend. How do you handle that?",
    "label": "Family Dynamics"
  },
  {
    "title": "I am the only young person at my workplace",
    "selftext": "I have gotten a part-time job in a small shop. All my colleagues are 40+, and they are nice, but I feel a bit lonely. They talk about house prices, children and pensions, and I can't relate at all. The lunch breaks are a bit awkward. Are there others who have tried to be 'the young one' at a workplace?",
    "label": "Work, Study & Career"
  },
  {
    "title": "I feel that my friends are more popular than me on social media",
    "selftext": "It’s a stupid thing to get upset about, but I can’t help it. When my friends post a picture, they get hundreds of likes. When I post something, I might get only 30. It makes me feel unpopular and invisible. I know it’s superficial, but it affects my self‑esteem. How do you stop worrying about likes?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I am afraid of being stung by a wasp",
    "selftext": "Every summer the same story. I cannot relax outside because I have panic anxiety for wasps. If one comes near me, I run screaming away. People think it's funny, but for me it's a real phobia. Is there a way to become less afraid of them?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "How do you avoid impulse buying when you're in the supermarket?",
    "selftext": "I always go to the supermarket to buy milk and end up leaving with a basket full of chips, chocolate, and other things I didn't need. Especially if I'm hungry. Do you have a good trick to stick to the shopping list and avoid expensive impulse purchases?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "What should you do about a bicycle helmet that smells sour?",
    "selftext": "I cycle every day, and my bicycle helmet has started to smell really sour from sweat. It's pretty unpleasant to wear it. Can you wash it? Or is there a spray or another trick that can remove the odor? I'd rather not buy a new one.",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People who can't park within the spot",
    "selftext": "I get so irritated by cars that park crookedly and take up one and a half parking spots. It's selfish and inconsiderate towards everyone else looking for a spot. How hard can it be to straighten the car so it fits straight? It takes a couple of extra seconds. Argh!",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend is secretly a fan of a 90s boy band",
    "selftext": "I was rummaging through my boyfriend's old Spotify playlists and discovered a playlist that only contained songs by the Backstreet Boys.\nOver 50 songs.\nWhen I asked him about it, he turned completely red and said it was a mistake.\nBut I've heard him humming 'I Want It That Way' in the bathroom.\nI think it's super funny and cute.\nShould I tease him about it?",
    "label": "Love & Dating"
  },
  {
    "title": "My dad has started winter bathing and wants me to join",
    "selftext": "My dad has taken up a new hobby: winter bathing. He's completely hooked on it and constantly talks about 'the cold thrill' and 'endorphin rush'. Now he's trying to persuade me to join. The thought of jumping into ice-cold water is my worst nightmare. How do I politely say no for the 117th time without sounding like a boring loser?",
    "label": "Family Dynamics"
  },
  {
    "title": "I regret my choice of elective, can I change?",
    "selftext": "I have started a new elective at school, and I can already feel that it is completely wrong for me. It is much harder than I thought, and the subject does not interest me at all. Is it too late to switch to another class? Or am I forced to fight through it for the rest of the year?",
    "label": "Work, Study & Career"
  },
  {
    "title": "My friend always invites herself",
    "selftext": "I have a friend who tends to bring herself along to things. If she hears that I'm doing something with another friend, she says 'Cool, when are we meeting?'. It's awkward to say that she wasn't invited. Sometimes it's nice, but I also need to see my other friends alone. How do you handle that?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I feel dizzy when I stand up too quickly",
    "selftext": "Very often when I stand up quickly from a chair or bed, it goes dark for my eyes, and I become completely dizzy for a few seconds. Is this normal? I've heard it might be something with blood pressure. Should I mention it to my doctor, or is it just a harmless thing that many experience?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "I am afraid to check my bank account",
    "selftext": "Towards the end of the month, I consciously avoid checking my online banking. I'm afraid to see how little money is left. I know it's a dumb strategy, because I lose my overview. But seeing a low number stresses me. Are there others who have 'bank account anxiety'?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "What is the best way to remove a sticker from a new book?",
    "selftext": "I bought a book, but there's a large price tag stuck directly on the front cover. I'm afraid to tear it off because it might damage the cover or leave a sticky residue. Is there a safe trick to remove stickers from paper without causing damage?",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People who stand in the middle of an escalator",
    "selftext": "What is the logic behind standing in the middle of a step on an escalator so that no one can pass? The unwritten rule is: stand to the right, walk to the left. It's a simple system that works. Yet there are always people who block the whole thing. It's so inconsiderate towards people who are in a hurry.",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend is bad at giving compliments",
    "selftext": "I have really put a lot of effort into my clothes and makeup for our date tonight. When my boyfriend saw me, he just said 'Well, are you ready?'. He never says that I'm pretty or look good. I know he thinks so, but I need to hear it from time to time. How can I ask for more compliments without sounding desperate?",
    "label": "Love & Dating"
  },
  {
    "title": "My dog prefers my brother to me",
    "selftext": "It is technically my dog. I feed it and walk it. But as soon as my older brother comes into the room, it's as if I don't exist. The dog wags, jumps up and only wants to play with him. I actually feel a bit sad about that. Can a dog have a favorite person?",
    "label": "Family Dynamics"
  },
  {
    "title": "How do you balance homework, part-time jobs, and friends?",
    "selftext": "I feel like I'm running around all the time. Either I have homework to do, or a shift at my job, or my friends want to do something. I never feel like I have enough time for everything, and I constantly feel guilty about something. How do you manage to get it all together?",
    "label": "Work, Study & Career"
  },
  {
    "title": "My friend is a bad loser in FIFA",
    "selftext": "Every time I play FIFA with my friend and win, he gets furious. He yells at the screen, accuses me of cheating, and sometimes throws the controller. It completely ruins the fun. Should I just let him win for the sake of peace, or should I tell him to pull himself together?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I get a side cramp as soon as I start running",
    "selftext": "I really want to get in better shape, but every time I try to run, I get a cramp in my side after only a couple of minutes. It's a sharp, stabbing pain that makes it impossible to continue. What am I doing wrong? Is it my breathing? Is there a trick to avoid it?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "My roommate uses my stuff without asking",
    "selftext": "I've noticed that my roommate uses my shampoo, my hair dryer, and has even 'borrowed' my hoodie. He never asks for permission, but just puts the items back (sometimes). I don't want to be a nag, but I find it annoying and it crosses my boundaries. How do I tell him in a relaxed way?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "What is the best way to fold a sheet with elastic?",
    "selftext": "Is there even a proper way to fold a facon sheet? Every time I try, it ends up as a big, crumpled pile that I just stuff into the closet. I've watched videos on YouTube that look so easy, but I just can't get it to work. Is there a secret trick?",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People who leave their shopping carts in the middle of the aisle",
    "selftext": "Why do people leave their shopping carts in the middle of a narrow aisle in the supermarket while they stand and look at items? It blocks everyone else. But pull the cart to the side! It's common courtesy and takes no extra time. It's a small irritation that always hits me.",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My partner and I have completely different circadian rhythms",
    "selftext": "I am an A-person and love to get up early. My partner is a B-person and is awake until 2 a.m. That means we almost never go to bed or get up together. I miss having mornings together. Can a relationship work when you live in two different time zones?",
    "label": "Love & Dating"
  },
  {
    "title": "My mom always calls when I'm in the middle of something important",
    "selftext": "It's as if my mom has a sixth sense for when I'm most occupied.\nIn the middle of an exam assignment, in the middle of an important meeting, in the middle of dinner.\nThen she calls.\nAnd it's never something urgent.\nI love her, but her timing is incredible.\nIs that a mom thing?",
    "label": "Family Dynamics"
  },
  {
    "title": "My colleague at the cafe gives his friends free coffee",
    "selftext": "When my colleague's friends come by the cafe where we work, he always gives them coffee and cake 'on the house'. Our boss is rarely there, so he doesn't notice. I don't think it's okay, because it's theft. But if I say something, I become unpopular. What should I do?",
    "label": "Work, Study & Career"
  },
  {
    "title": "My friend tells the ending of movies and series",
    "selftext": "I have a friend who always ends up 'spoiling' movies and series for me. She always watches things before me, and she can't help but say things like 'just wait until you see what happens to him!'. It totally ruins the suspense. I've told her several times, but she keeps going. How do I get her to understand?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I am the only one in my family who doesn't like football",
    "selftext": "All of my family is obsessed with football. My dad, my brothers, even my mom. Every weekend they gather in front of the TV and shout. When there's a national match, it's even worse. I think it's the most boring sport in the world. I feel like an outsider in my own family. Should I just pretend I'm interested?",
    "label": "Family Dynamics"
  },
  {
    "title": "Is it a bad sign if a guy never asks questions?",
    "selftext": "I’ve been chatting with a guy for a couple of weeks. He always replies politely to my messages and is happy to talk about himself. But he almost never asks me questions back. I’m the one keeping the conversation going. Is he just bad at chatting, or is it a sign that he’s not really interested?",
    "label": "Love & Dating"
  },
  {
    "title": "How do you say no to lending out your clothes?",
    "selftext": "My little sister always wants to borrow my clothes. Sometimes it's okay, but often she ends up staining them or forgetting to return them. Now she wants to borrow my favorite dress for a party. I don't feel like lending it out, but I know she'll get upset if I say no. What's the best way to say no?",
    "label": "Family Dynamics"
  },
  {
    "title": "I feel pressured to know what I want to be when I grow up",
    "selftext": "I am in 9th grade, and all adults keep asking me all the time: 'What do you want to be?'. The truth is, I have no idea. It stresses me out a lot, because it sounds like everyone else has a plan. Is it normal not to know what you want to be when you are 15?",
    "label": "Work, Study & Career"
  },
  {
    "title": "My friend sends me 50 TikToks a day",
    "selftext": "I have a friend who communicates almost exclusively via TikToks. My inbox is flooded. It's funny enough, but I miss having a real conversation. When I write 'how's it going?', he replies with a video of a dancing dog. Is that the new way to be friends?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I don't like sleeping at other people's houses",
    "selftext": "Even though I'm at my best friend's house, I can never really sleep well when I'm not in my own bed. I stay awake for hours. It's as if my brain can't relax. That means I often say no to sleepovers, which is a bit sad. Does anyone have a trick to sleep better when you're out?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "I regret a costly online purchase. Can I return it?",
    "selftext": "I ended up buying a pair of pretty expensive sneakers online last night. Now I regret it. They haven't been shipped yet. Can I still cancel the order? And what if they have already been shipped? Is it troublesome to return items that one has bought online?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "What is the best way to avoid your lunchbox becoming boring?",
    "selftext": "My rye bread lunch is always completely dry and boring when I have to eat it for lunch. The cucumber has become limp, and the cheese is sweating. Do you have any clever tricks to keep the lunchbox fresh and tasty? Something with cooling elements or a particular way to pack it?",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "Why is there always one sock that disappears in the washing machine?",
    "selftext": "It is one of life's great mysteries. I put a pair of socks in the washing machine, and when I take the clothes out, there's only one left. Where does the other go? Is it eaten by the machine? Is there a parallel dimension just for single socks? I have a whole drawer full of them.",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend is friends with his ex's family",
    "selftext": "My boyfriend is not friends with his ex, but he is still really good friends with her parents and brother. He visits them from time to time and writes to them. I think it's a bit strange. Isn't it a sign that he hasn't fully moved on? Or is it me who is too jealous?",
    "label": "Love & Dating"
  },
  {
    "title": "My grandmother always gives me clothes that are three sizes too big",
    "selftext": "Every Christmas and birthday I get a blouse or a pair of pants from my grandmother. It's sweet of her, but they are consistently several sizes too big. It's as if she still thinks I'm a little child who needs to 'grow into it'. I always smile and say thank you, but I can never use them. Can I say something?",
    "label": "Family Dynamics"
  },
  {
    "title": "Everyone in my class seems smarter than me",
    "selftext": "I just started high school, and I feel like the dumbest person in the class. Whenever the teacher asks a question, there are always 10 others who raise their hand before I even understand the question. I'm afraid that I'm not smart enough to be here. Is it normal to feel like this at the beginning?",
    "label": "Work, Study & Career"
  },
  {
    "title": "I am afraid of missing out on things (FOMO)",
    "selftext": "When I look at Snapchat or Instagram and see that my friends are out doing something that I'm not part of, I get a terrible feeling in my stomach. Even though I actually wanted to stay home. I am afraid of missing out on a fun experience or an inside joke. How do you fight FOMO (Fear Of Missing Out)?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I get bruises easily",
    "selftext": "I get bruises for no reason. If I just step on a table leg, I get a huge, purple bruise for several weeks. My friends tease me and say I'm made of glass. Is it normal to get bruises so easily? Could it be a sign that I'm missing some vitamins?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "Is it normal for parents to check your account?",
    "selftext": "I am 17 and have a part-time job. My mom wants us to look at my online banking together once a month to 'teach me about budgeting'. But it feels more like she's monitoring what I spend my own money on. Is this normal, or is it an invasion of my privacy?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "How do you patch a bicycle?",
    "selftext": "I've had a puncture for the first time in my life. I've bought a patch kit, but I have no idea how to use it. Should the tire be deflated? What is that little metal piece for? It seems so complicated. Is there a simple guide for beginners on how to patch a bicycle?",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People who don't hold the door for the next person",
    "selftext": "Someone walks right behind a person into a building. Instead of holding the door for a second, they just slam it straight into someone's head. It's so rude. It takes zero effort to be a little considerate. Is common courtesy completely extinct?",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend is terrible at singing, but he does it all the time",
    "selftext": "My boyfriend loves to sing.\nIn the car, in the bathroom, while he's cooking.\nThe problem is that he sings incredibly off-key.\nIt's not just a little off, it's completely off.\nI love him, but the sound is driving me crazy.\nCan you kindly ask your boyfriend to turn down the singing a bit?",
    "label": "Love & Dating"
  },
  {
    "title": "My parents are checking my browsing history",
    "selftext": "I have discovered that my dad is checking the browsing history on our shared computer. He has confronted me with some of the sites I've visited (nothing bad, just YouTube and that sort of thing). I feel that it's a huge invasion of my privacy. I am 16 years old. Does he have the right to do that?",
    "label": "Family Dynamics"
  },
  {
    "title": "My classmate always asks what he got for his assignment",
    "selftext": "Every time we get an assignment back, my classmate leans over and asks: 'What did you get?'. I find it annoying and private. I don't want to share my grades with him. How can I say no in a polite way, without it becoming awkward to sit next to him for the rest of the year?",
    "label": "Work, Study & Career"
  },
  {
    "title": "How do you keep in touch with friends who have moved to a boarding school?",
    "selftext": "Several of my best friends have started at a boarding school. We promised to keep in touch, but they are so busy with their new lives, and we don't write to each other as much anymore. I'm afraid we are drifting apart. Do you have any good advice on how to preserve the friendship when you suddenly are far from each other?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I hate having PE in school",
    "selftext": "I really am not good at sports, and I hate PE classes. I'm always the one who gets picked last, and I feel clumsy and stupid. I get stomach pain every time we have PE. Is there a way to make it less awful?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "I have received my first payslip and I don't understand it",
    "selftext": "I started my first part-time job and just received my first payslip. There are a lot of things I don't understand: AM contribution, A tax, ATP... Why am I paid much less than what my hourly wage should give? Is there anyone who can explain a payslip in a simple way?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "What is the best method to remove dog hair from clothes?",
    "selftext": "I love my dog, but I'm going crazy over all the dog hair stuck to my clothes, especially the black ones. A regular lint roller doesn't work well enough. Is there a secret weapon in the fight against dog hair? A special washing method or a smart tool?",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People who talk on speakerphone in the bus",
    "selftext": "Why has it become a thing to have private conversations on speaker in public transport? No one on the bus is interested in hearing about your appointment with the doctor or your argument with your partner. It's so thoughtless. Buy a pair of headphones, though!",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend wants to name our future children after characters from The Lord of the Rings",
    "selftext": "My boyfriend and I were joking about future children. It turned out he wasn't joking when he said he would name our son after Aragorn and our daughter after Arwen. I also love the movies, but I think maybe that's going too far. How do you navigate that conversation?",
    "label": "Love & Dating"
  },
  {
    "title": "My mother insists on making a lunchbox for me, even though I'm 18",
    "selftext": "I just turned 18 and am in 3.g. Still, my mother insists on packing a lunchbox for me every morning. I have said that I can easily do it myself, but she says it's her way of showing care. It's sweet, but I also feel like a little child. Should I just let her do it?",
    "label": "Family Dynamics"
  },
  {
    "title": "I am the only one at my workplace who doesn't have a tattoo",
    "selftext": "I work at a café where it seems like all the other staff have tattoos. They often talk about their tattoos and which new ones they plan to get. I have none and I don't feel like getting one either. Sometimes I feel a bit left out, as if I'm the 'boring' one. Is that weird?",
    "label": "Work, Study & Career"
  },
  {
    "title": "My friend wants us to have matching friendship tattoos",
    "selftext": "My best friend has suggested that we get matching friendship tattoos.\nA small symbol that shows our friendship.\nHe's really excited about the idea.\nI'm not sure if I'm ready to get a tattoo, and what if one day we are no longer friends?\nHow do I say no without hurting him and making it sound like I don't appreciate our friendship?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I can't stand the sound of others eating",
    "selftext": "The sound of chewing, swallowing, and crunching can drive me mad. Especially if it's something crunchy like chips. I know people can't help it, but I genuinely get irritated and have to leave the room. It makes it hard to eat with others. Is there a diagnosis for this?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "Is it a bad idea to borrow money from one's parents?",
    "selftext": "I would really like to buy a new computer for my studies, but I haven't saved enough. I'm considering asking my parents if I can borrow the rest from them. Is it a bad idea? I'm afraid it will make our relationship weird if I suddenly owe them money.",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "How to get the best seat in the cinema?",
    "selftext": "Every time I go to the cinema, I am uncertain. Where is the best seat? Is it in the middle of the middle row? Or a bit further back? I hate sitting too close or too far out on the side. What is the scientifically proven optimal placement for the best movie experience?",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People who don't remove their empty coffee cups from the table at a café",
    "selftext": "When people are finished at a café, why do they leave their dirty cups and crumbs on the table? There is a trash bin right at the exit. It's bad manners towards the staff and towards the next guests who want to sit at a clean table. How hard can it be to clean up after yourself?",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend is terrible at wrapping gifts",
    "selftext": "I love my boyfriend, but he is the worst in the world at wrapping gifts. He uses way too much tape, the paper is crinkled, and it looks like something a 5-year-old made. I know it's the thought that counts, but I can't help but laugh a little when I get a gift that looks like a deformed lump. Should I offer to teach him?",
    "label": "Love & Dating"
  },
  {
    "title": "My parents want me to read the same book as them",
    "selftext": "My parents have joined a book club, and now they want me to read the month's book as well, so we can 'discuss it as a family'. The problem is that they are adult, boring novels about crisis-stricken marriages. I'd rather read fantasy. How do I politely say no to the family book club?",
    "label": "Family Dynamics"
  },
  {
    "title": "My part-time job is boring, but the money is good",
    "selftext": "I work putting goods on shelves in a supermarket. It's the most boring job in the world, and time goes incredibly slowly. But the salary is actually quite good for someone my age. Should I find a more fun, but perhaps lower-paid job? Or should I just endure for the sake of the money?",
    "label": "Work, Study & Career"
  },
  {
    "title": "I am afraid to speak my mind in my friend group",
    "selftext": "In my friend group there are a few people who have very strong opinions. If you disagree with them, they quickly become irritated. Therefore I often just pretend to agree to avoid bad mood. I am tired of not being able to be myself. How can I get better at standing by my own opinions?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "Is it dangerous to crack fingers?",
    "selftext": "I have a habit of cracking my fingers. I like the sound and the feeling. My mother always says that I get arthritis from it when I get old. Is that true? Or is it just a myth? I would like to know if I actually damage my joints.",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "How to find a good but affordable hairdresser?",
    "selftext": "I really need to get a haircut, but I think it's so expensive to go to a hairdresser. There are the very cheap places where I'm afraid they'll ruin my hair, and then there are the expensive salons I can't afford. Is there a middle ground? How do you find a hairdresser who is skilled but doesn't cost a fortune?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "Good advice for waking up in the morning when you're a B-person",
    "selftext": "I hate getting up in the morning. I snooze my alarm at least five times and am always about to be late. It's a battle every single day. Have you, other B-people, found a trick that makes it just a little easier to get out of bed? A special alarm app or a morning routine?",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People who smoke right outside the entrance to stores",
    "selftext": "Why do people stand right in front of a store or center's door to smoke? It means that everyone else has to walk through a cloud of smoke to get in and out. It's so inconsiderate. But go a few meters away. Is it too much to ask?",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend has a tattoo with his ex's name",
    "selftext": "My boyfriend has a tattoo on his arm with his ex's initials. It's an old thing, and he says he wants it covered, but he never gets it done. It bothers me more than I want to admit. Every time I see it, I'm reminded of her. Can I allow myself to push for him to have it removed or covered?",
    "label": "Love & Dating"
  },
  {
    "title": "My little brother always eats the last piece of everything",
    "selftext": "No matter if it's cake, pizza or chips, my little brother always makes sure to take the very last piece. Without asking. It drives me crazy. I was looking forward to the last piece of chocolate cake, and now it's gone. Is this normal little brother behavior, or is he just selfish?",
    "label": "Family Dynamics"
  },
  {
    "title": "My boss wants me to be friends with him on Facebook",
    "selftext": "My new boss sent me a friend request on Facebook. I don't really feel like accepting it, because I use Facebook for private stuff with my friends. But I'm afraid it will become awkward at work if I ignore it. What do you do in such a situation?",
    "label": "Work, Study & Career"
  },
  {
    "title": "My friends have started speaking in 'code language'",
    "selftext": "In my friend group, they have started using a lot of abbreviations and internal expressions that only they understand. When I ask what it means, they just laugh and say 'it's a long story'. It feels like they are consciously excluding me. What's going on?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "Why do you get a 'brain freeze' when you eat ice cream?",
    "selftext": "Every time I eat ice cream or drink a very cold slush ice too quickly, I get that intense, stinging headache right in the forehead. It only lasts a couple of seconds, but it hurts like crazy. What's happening in the brain? And is there a trick to make it go away faster?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "Is it a bad idea to buy a used phone?",
    "selftext": "My phone is about to die, and I can't afford a brand-new one. I'm considering buying a used one online. Is it a good way to save money, or is it too risky? What should one be aware of, e.g., with the battery? And where can one find the most trustworthy sellers?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "What is the easiest way to split an avocado?",
    "selftext": "I love avocados, but I always struggle to get the pit out. I'm afraid of cutting myself when I try to stab the knife into it. Is there a safe and easy method to open an avocado and remove the pit without getting hurt?",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People who watch videos on their phones without headphones",
    "selftext": "I was sitting on the train yesterday next to a man who was watching one TikTok video after another with full volume. The same annoying song over and over again. Why don't people think about how they are bothering everyone around them? It's so selfish. A pair of headphones costs almost nothing.",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My partner is obsessed with counting calories",
    "selftext": "My partner has started counting calories in everything she eats. She weighs her food and inputs everything into an app. It's started to take up a lot of space, and it's not cozy to eat together anymore, because she always comments on how many calories are in my food. I'm worried whether it's becoming unhealthy for her. How do I talk to her about it?",
    "label": "Love & Dating"
  },
  {
    "title": "My dad has started using emojis incorrectly",
    "selftext": "My dad has just discovered emojis, and he uses them completely incorrectly. He sends the eggplant emoji when talking about dinner, and the crying-laugh emoji when he writes something sad. Yesterday he ended a message about our dog being sick with a wink-smiley. It's both confusing and a bit funny. Should I try to teach him what they mean?",
    "label": "Family Dynamics"
  },
  {
    "title": "My teacher cannot spell",
    "selftext": "My Danish teacher constantly makes spelling and grammar mistakes in the assignments he distributes and on the board. It's hard to take his teaching seriously. We are a group of students who have talked about it. Can we tell him in a polite way, or should we go to the administration?",
    "label": "Work, Study & Career"
  },
  {
    "title": "My friend is an 'energy vampire'",
    "selftext": "I have a friend who is always negative. Every time we meet, she complains about her job, her boyfriend, her family. I feel completely drained of energy after being with her. I want to be a good friend, but it's so heavy. How can I protect my own energy without rejecting her?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I always get goosebumps when I touch peach skin",
    "selftext": "This is really strange. I can't touch the skin of a peach. That fuzzy surface gives me goosebumps and gooseflesh all over my body. I can eat them if others have peeled them. Am I the only one in the world with peach phobia?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "How do you ask for a receipt if you paid with MobilePay?",
    "selftext": "I bought a used item from a private individual and paid with MobilePay. Now I would like to have some form of receipt for my purchase. How do you ask for it without it seeming like you don't trust the seller? Isn't the MobilePay transfer itself proof enough?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "Good advice on getting a cat to use its scratching post?",
    "selftext": "I bought a nice new scratching post for my cat. But she is completely indifferent to it and keeps scratching my sofa. I have tried spraying it with catnip and showing her how to do it. Nothing works. How do you convince a stubborn cat to use the scratching post instead of the furniture?",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "I hate it when people say 'I'll get back to you'",
    "selftext": "Especially in professional contexts. 'I'll get back to you' is the most non-committal response in the world. It means everything from 'I'll reply in five minutes' to 'I intend to forget about this until you push for an answer in three weeks'. However, be specific! Tell when you will get back to me.",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend loves ASMR videos, and I think it's creepy",
    "selftext": "Every evening my boyfriend falls asleep to ASMR videos on YouTube. The sound of whispering, tapping on objects, and mouth sounds fills our bedroom. He says it's relaxing. I think it's incredibly creepy and I can't sleep because of it. Is there a compromise here, or do I have to sleep with earplugs for the rest of my life?",
    "label": "Love & Dating"
  },
  {
    "title": "My parents always compare me to my 'perfect' older brother",
    "selftext": "Whatever I do, my older brother is always better in my parents' eyes. 'Your brother got a 12 in that subject', 'Your brother was much better at football'. It's so demotivating, and it feels like I can never live up to their expectations. I've tried to tell them, but they think it's 'just as motivation'.",
    "label": "Family Dynamics"
  },
  {
    "title": "My boss has bad breath",
    "selftext": "My boss is a good guy, but he has terrible breath. When he stands close and explains something, it's hard to concentrate on anything else. It's a very sensitive topic. Can you even do anything? Should you just hold your breath and suffer in silence?",
    "label": "Work, Study & Career"
  },
  {
    "title": "My friend is a 'planning dictator'",
    "selftext": "When my friend and I are going to do something, everything has to be planned down to the smallest detail. She creates a whole schedule for the day with times for everything. There's no room for spontaneity. If we are five minutes late, she gets stressed. I am much more relaxed. How can I get her to relax a bit without her thinking that I don't care about our appointments?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I can't stand seeing blood, not even in movies",
    "selftext": "I get dizzy and nauseous whenever I see even a little bit of blood. This applies both in real life and in movies. It's quite inconvenient, as it excludes a lot of films and series that my friends would like to watch. Is there a way to train myself to become less sensitive to it?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "Is it stingy to ask your guests to pay for takeaway?",
    "selftext": "I have a couple of friends visiting, and we have talked about ordering pizza. I am a student and don't really have the means to give pizza to three people. Is it okay to say 'Great idea, you can just send your share via MobilePay'? Or is it expected that the host pays for the food?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "How to avoid tears when chopping onions?",
    "selftext": "Every time I have to chop an onion, it ends up with my eyes watering, and it goes crazy. I've heard all sorts of home remedies: light a candle, take a sip of water, use goggles. What actually works? There must be a scientific trick.",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People who stand right in front of you in line because they 'just want to ask something'",
    "selftext": "I have been standing in line for 10 minutes. Then someone comes and pushes past everyone with the words 'I just want to ask something'. And then they end up having to exchange a product and have a long conversation with the cashier. It's not 'just'. Stand at the back of the line like all of us others. It's so cheeky.",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend wants us to share a toothbrush to be 'environmentally friendly'",
    "selftext": "My boyfriend has become very environmentally conscious, which is great. But now he has suggested that we share a toothbrush to reduce plastic waste. He thinks that since we kiss anyway, it's the same. I think it's incredibly unhygienic and disgusting. Am I the one who's sensitive, or is his suggestion completely out of line?",
    "label": "Love & Dating"
  },
  {
    "title": "My mother-in-law is messing with my home when she visits",
    "selftext": "Every time my mother-in-law visits, she goes around moving my things. She straightens the pictures, rearranges the pillows on the sofa, and arranges the items on my bookshelf differently. She says she's \"just helping to make it cozy\". I think it's overstepping boundaries. How do I tell her to leave my things alone?",
    "label": "Family Dynamics"
  },
  {
    "title": "I ended up sending an email to the whole company that was only meant for one person",
    "selftext": "I was going to send a somewhat informal email with an internal joke to a colleague. I ended up clicking 'reply all' on a group email, so now the whole company (including the director) has received it. I'm sinking to the floor in shame. Should I send an 'apology' email afterward, or should I just hope people ignore it?",
    "label": "Work, Study & Career"
  },
  {
    "title": "My friend imitates everything I say and do",
    "selftext": "I have a friend who has started acting like a copy of me. She uses the same expressions as me, has bought a copy of my bag, and always orders the same as me when we are at a café. At first it was flattering, but now it's just annoying. It feels like she doesn't have her own personality. What should I do?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I hate the feeling of certain textiles",
    "selftext": "I can't stand touching certain materials. Velvet, microfiber cloths, and wool give me an itchy feeling and a sense of discomfort. It's as if they 'stick' to my fingers. Are there others who have some kind of textile phobia? It's hard to explain to people.",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "My friend wants me to invest in cryptocurrency with him",
    "selftext": "My friend has become completely absorbed by cryptocurrency and is convinced that he will get rich. Now he is trying to persuade me to invest my savings together with him in a new, unknown 'coin'. He says it's a 'sure winner'. I am very skeptical. Doesn't it sound like a really bad idea?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "What is the best trick to keep herbs alive?",
    "selftext": "Every time I buy a pot of basil or parsley at the supermarket, it dies within a week. I water it and put it in the light, but it always turns out sad and wilted. What is the secret to keeping those supermarket herbs alive for more than a couple of days?",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People who leave the toilet without washing their hands",
    "selftext": "I was at a public restroom today, and the man in the stall next to me came out, looked at himself in the mirror, and went straight out the door.\nWithout washing his hands.\nIt's simply so disgusting and unhygienic.\nEspecially after the recent years.\nHow hard can it be to use 20 seconds with soap and water?",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend is too close to his mother",
    "selftext": "My boyfriend talks on the phone with his mother several times a day. She knows everything about our life, our arguments, our plans. He asks her for advice on everything. I sometimes feel like we are three people in our relationship. I have tried to talk to him about it, but he just says he has a good relationship with his mother. Where is the line?",
    "label": "Love & Dating"
  },
  {
    "title": "My little sister gossips about me to my parents",
    "selftext": "Everything I tell my little sister in confidence she passes on to our parents.\nShe can't keep a secret at all.\nThat means I don't dare tell her anything personal anymore.\nIt's sad, because we used to be close.\nHow can I get her to understand that this destroys my trust in her?",
    "label": "Family Dynamics"
  },
  {
    "title": "My colleague sings along to the songs on the radio (but can't remember the lyrics)",
    "selftext": "At work, the radio plays all day. My colleague loves to sing along, but he never knows the lyrics. He just sings random words that sound a bit like the real lyrics. It's incredibly disruptive and sounds terrible. Should we just live in silence, or can we ask him to stop?",
    "label": "Work, Study & Career"
  },
  {
    "title": "My friend always takes pictures of her food before we eat",
    "selftext": "Every time my friend and I go out to eat, she has to take pictures of the food for her Instagram.\nShe spends several minutes finding the right angle while my food gets cold.\nIt drives me crazy.\nCan I ask her to stop, or is that just part of dining out these days?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I always get an electric shock from everything in winter",
    "selftext": "As soon as it gets cold and dry in the weather, I get shocks from everything.\nDoor handles, shopping carts, my cat.\nThey are small, unpleasant jabs.\nIs there a scientific explanation for why it is worse in winter?\nAnd is there a trick to avoid it?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "My roommate has an alarm that rings for an hour every morning",
    "selftext": "My roommate is extremely difficult to wake up.\nHis alarm starts ringing at 6 a.m., and then he snoozes it every 10 minutes until 7 a.m., when he finally gets up.\nI am awake from the first time it rings.\nIt totally ruins my sleep.\nI have talked to him about it, but nothing changes.\nWhat do I do?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "What is the best way to keep track of your passwords?",
    "selftext": "I have so many different passwords for all sorts of things, and I can never remember them. I always end up resetting my password. I know it's a bad idea to use the same one everywhere. Do you use a password manager app? Or do you have a smart system in a notebook? I need a solution.",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People who don't use headphones in the gym",
    "selftext": "I was at the gym yesterday, and a guy next to me was watching a movie on his phone with full volume. I was forced to listen in on the dialogue. Everyone else had headphones on. Why do some people think the whole center is interested in listening to their entertainment? It's so disrespectful.",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "Is it a 'red flag' if your date is rude to the waiter?",
    "selftext": "I was on a date with a guy who was really sweet to me, but quite condescending and rude to the waiter. He was impatient and spoke in a commanding tone. I got a bad gut feeling. Is that a sign of how he really is? Or am I overreacting?",
    "label": "Love & Dating"
  },
  {
    "title": "My dad wants me to take over his old hobby",
    "selftext": "My dad collected stamps when he was young.\nNow he has dug up his old albums and wants me to take over the hobby.\nHe has bought a tweezers and a magnifying glass for me.\nI think it's the most boring hobby in the world.\nHow do I politely say no without hurting him?",
    "label": "Family Dynamics"
  },
  {
    "title": "I ended up liking my boss's LinkedIn post",
    "selftext": "I was scrolling on LinkedIn and ended up liking my boss's post about 'synergy in leadership' by accident. Now I'm afraid he'll think I'm a sycophantic employee just trying to score points. Should I remove my like again, or would that be even more awkward? What is the LinkedIn etiquette here?",
    "label": "Work, Study & Career"
  },
  {
    "title": "My friend always invites me to parties where I don't know anyone",
    "selftext": "My friend often invites me to parties at her other friends' places. The problem is that she then disappears and talks to all sorts of people, and I end up alone in a corner knowing no one. I feel like a social sidekick. Is it bad manners of hers not to stay with me, or should I just be better at talking to strangers?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "Why does my foot fall asleep, and how can I wake it up fastest?",
    "selftext": "Sometimes if I've been sitting in a wrong position, my foot 'falls asleep'. It's a very unpleasant prickling and numb sensation, and I can almost not walk on it. What is happening in the body? And is there a trick to get the feeling back faster than just waiting?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "Is it worth the hassle to collect bottle deposits?",
    "selftext": "My roommate collects all our bottles and cans in large bags and redeems them once a month. I think it gets messy and smells. I'd rather just throw them away. Are there really that many dollars to be made from the deposit that it's worth the hassle?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "What is the best remedy for a sunburned nose?",
    "selftext": "I was out in the sun yesterday and forgot sunscreen. Now my nose is bright red, swelling and completely sore. What is the best and fastest way to relieve a sunburn? Aloe vera? Cold cream? Good advice is welcome!",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People who record an entire concert with their phone",
    "selftext": "I went to a concert over the weekend, and the person in front of me held up their phone and filmed the ENTIRE concert. It ruined the view for everyone behind, and why would anyone want to watch an entire concert through a small screen? Be present in the moment, though. It's so annoying.",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend hasn't deleted his dating profile",
    "selftext": "My boyfriend and I have been together for three months, and we have agreed that we are exclusive. A female friend told me that she saw him on Tinder the other day. I confronted him, and he said that he had just forgotten to delete the app. Should I believe him, or is this a huge 'red flag'?",
    "label": "Love & Dating"
  },
  {
    "title": "My parents will not accept that I am a vegetarian",
    "selftext": "I have decided to become a vegetarian for the sake of animals and the environment. My parents think it's nonsense. My dad keeps offering me meat and jokes that I 'just eat grass'. It's hurtful and disrespectful. How can I get them to accept my choice?",
    "label": "Family Dynamics"
  },
  {
    "title": "My internship uses me as a free coffee maker",
    "selftext": "I am interning at a place where I had hoped to learn a lot. But my only tasks are to fetch coffee, make copies, and clean up after lunch. I feel like a free service worker. How can I politely ask to get some more relevant tasks?",
    "label": "Work, Study & Career"
  },
  {
    "title": "I am the only one in the group who always has to drive",
    "selftext": "I am the only one in my friend group who has a car. Therefore it is always me who has to drive when we go out together. I am rarely offered gas money, and that also means I can never drink anything. I am getting tired of being the group's regular driver. How do I bring it up?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I can't stand the smell of coriander",
    "selftext": "For me coriander tastes and smells like soap. It's a terrible, perfumed taste that ruins all food. My friends love it and put it on everything. They say I'm picky. But I've read that it's genetic. Are there other 'coriander-haters' out there?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "I received a parking ticket that I think is unfair",
    "selftext": "I received a parking ticket for keeping one wheel a little bit outside the curb. It was the only available spot, and the car next to it was parked crookedly. I think it's petty. Is it worth filing an appeal against such a ticket, or is it a waste of time?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "How to get sand out of everything after a beach trip?",
    "selftext": "I love being at the beach, but I hate that you have sand everywhere for several days after. In the bag, in the car, in the bed. It feels like it multiplies. Is there a genius trick to remove sand efficiently before you go home?",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People who stand too close to someone at the ATM",
    "selftext": "When you stand and need to withdraw money, why do people feel the need to stand just behind you and look over your shoulder? Give me some space, though! It's both a matter of privacy and security. There should be a discretion line at all ATMs.",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend is jealous of my friends",
    "selftext": "My boyfriend always gets a little moody and quiet if I say I'm going to have a girls' night with my friends. He doesn't say anything directly, but I can feel that he doesn't like it. He's afraid that we 'talk badly about him'. It's so exhausting to have to defend that I need time with my friends. What do I do?",
    "label": "Love & Dating"
  },
  {
    "title": "My parents have my location turned on in 'Find My iPhone'",
    "selftext": "I am 19 years old, but my parents still insist on having my location turned on in 'Find My iPhone'. They say it's for my safety. But I feel monitored. The other day my dad called and asked why I was at a particular place. Is it reasonable for them to keep track of everything I do?",
    "label": "Family Dynamics"
  },
  {
    "title": "I am afraid of taking a break from my studies",
    "selftext": "I am completely overwhelmed in my studies and really need a break. I am considering taking a half-year leave. But I am afraid that I will never come back and finish it. Is there anyone who has taken leave and has good experiences with returning?",
    "label": "Work, Study & Career"
  },
  {
    "title": "I am the 'mom', who always has to keep track of everything",
    "selftext": "In my friend group, it's always me who is the responsible one. I am the one who books the table, keeps track of the tickets, and makes sure everyone gets on the right train. I'm tired of being the group's project manager. How can I get the others to take a bit more responsibility?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "My ears become red and hot for no reason",
    "selftext": "Sometimes, out of the blue, one of my ears (always just one) suddenly turns flaming red and burning hot. It lasts for about half an hour and then disappears again. It happens whether I'm stressed or relaxed. What's going on? It's pretty strange.",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "Is it a bad idea to have a joint economy with your partner?",
    "selftext": "My partner and I are considering opening a joint account, where we both transfer money for fixed expenses and food. Is it a good idea when you are young and not married? What are the advantages and disadvantages? I'm a little afraid of losing my financial independence.",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "How do you prevent your black clothes from turning gray and fading in the wash?",
    "selftext": "All of my black T-shirts and pants quickly fade and look gray after I've washed them a few times. I wash them on low heat and with the wrong side out. Still, they lose their color. Do you have a secret washing trick to keep black clothes truly black?",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People who press the button at the pedestrian crossing multiple times",
    "selftext": "It won't turn green any faster if you keep hammering the button at the pedestrian crossing 20 times. The system has registered your press. All you achieve is making an annoying click sound for everyone else waiting. But have a little patience.",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend doesn't like my pets",
    "selftext": "I have two cats that I love everywhere on earth. My new boyfriend is not an 'animal person'. He ignores them and complains that there is cat hair everywhere. He has even suggested that I could find a new home for them. That will never happen. Can a relationship work when one partner doesn't like the other's pets?",
    "label": "Love & Dating"
  },
  {
    "title": "My dad always gives me 'good advice' about my driving",
    "selftext": "I just got my driver's license. Every time I drive with my dad, he comments on everything. 'You brake too late', 'Why didn't you shift gears there?', 'Keep more distance now'. I get so nervous and insecure. I know he means well, but it doesn't help at all. How do I get him to stop?",
    "label": "Family Dynamics"
  },
  {
    "title": "My boss asked me to make coffee because I am the only woman",
    "selftext": "We were supposed to have a meeting at work, and my boss looked at me and said: 'Would you be so kind as to make a pot of coffee for us?'. I am the only woman in the department. My male colleagues were never asked. I was so stunned that I just did it. But I am furious about it. Should I say something to him?",
    "label": "Work, Study & Career"
  },
  {
    "title": "My friend lies about small, trivial things",
    "selftext": "I have a friend who embellishes the truth all the time. She lies about small things, like what she did over the weekend, or whether she has seen a particular movie. They are not big lies, but it's strange, and it makes me doubt whether I can trust her with bigger matters. Why does she do that?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I have a habit of talking to myself",
    "selftext": "When I'm alone, I often talk to myself. I review my day, rehearse conversations or comment on what I'm doing. I just discovered that my roommate heard me doing it the other day. It's so embarrassing. Is it normal to talk to yourself, or am I going crazy?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "I found an error on my receipt - to my advantage. What should I do?",
    "selftext": "I just went shopping and discovered, when I got home, that the cashier had forgotten to scan a fairly expensive item. Should I go back to the store and pay for it? Or should I just be happy about my lucky mistake and leave it? What would an honest person do?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "How to remove wax from a tablecloth?",
    "selftext": "We had dinner yesterday, and wax from a candle has dripped onto my pretty white tablecloth. How do you remove it? I've heard something about an iron and coffee filters, but I'm afraid of making it worse. What is the best and safest trick?",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People who don't take their backpacks off in a packed bus",
    "selftext": "When the bus is full, why don't people take their huge backpacks off? They occupy the space of a whole person and constantly bump into other passengers every time they turn around. Take it off and put it between your legs. It's common courtesy.",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend is a 'backseat driver'",
    "selftext": "When I drive, and my boyfriend is the passenger, he comments on everything. 'You could have passed that', 'I would have taken the other way'. He even steps on an invisible brake pedal. It's so stressful to drive with him. How do I get him to relax and trust that I can drive well?",
    "label": "Love & Dating"
  },
  {
    "title": "My parents won't let me lock the door to my room",
    "selftext": "I am 16 years old, and I would like some privacy. But my parents say that I am not allowed to lock the door to my room because 'we are a family, and we have no secrets from each other'. They just burst in. I think this is an infringement of my boundaries. Don't I have the right to lock my door?",
    "label": "Family Dynamics"
  },
  {
    "title": "I'm tired of having to 'network'",
    "selftext": "At my university, everyone talks about how important it is to network. But I hate it. I think it's so fake and awkward to have to go around to events and try to 'sell yourself'. Can't you just get a job because you're good at what you do? Do you really have to play the social game?",
    "label": "Work, Study & Career"
  },
  {
    "title": "My friend is chronically late",
    "selftext": "I have a friend who consistently arrives late.\nNot just five minutes, but often half an hour or more.\nIt doesn't matter what we are doing.\nShe always has an excuse.\nI'm getting tired of wasting my time waiting for her.\nIt feels disrespectful.\nCan I say something to her?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I am afraid of riding the elevator alone",
    "selftext": "I always take the stairs if I can, because I hate riding the elevator alone. I'm afraid it will get stuck. I know it's irrational, but I get a racing heart just at the thought. Are there others who have claustrophobia in that way?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "Is it a good idea to share a streaming subscription with a friend?",
    "selftext": "My friend and I are considering sharing a Netflix subscription to save money. Is it a good idea? Are there any disadvantages, e.g., with the number of screens you can watch on simultaneously? And what do you do if one suddenly doesn't want to be part of it anymore?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "How to clean the screen on your computer or phone most effectively?",
    "selftext": "My computer screen is full of dust and grease fingerprints. What is the best and safest way to clean it without scratching or damaging it? Should you use a special cloth or liquid? Or is a dry cloth enough?",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People who leave meetings to 'take an important call'",
    "selftext": "I am so tired of colleagues who, in the middle of a meeting, suddenly stand up and leave the room because their phone is ringing. It is disruptive and signals that the call is more important than the meeting and everyone else's time. However, put your phone on silent and call back later. That is normal meeting culture.",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend is obsessed with his phone",
    "selftext": "My boyfriend pulls out his phone as soon as we have a free moment.\nIn the bus, in the supermarket queue, even while we watch a movie.\nI feel he is never really present.\nI just miss sitting and looking out the window together or talking.\nHow do I bring up the topic without sounding like a grumpy, tech-averse boomer?",
    "label": "Love & Dating"
  },
  {
    "title": "My stepmother gives me gifts that are obviously secondhand gifts",
    "selftext": "For my birthday I received a cream from my stepmother, where the jar was a bit dented, and it was clear that it had been opened. It's not the first time. I'm pretty sure she gives me gifts that she herself has received but doesn't want. Should I just smile and say thank you, or can I say something?",
    "label": "Family Dynamics"
  },
  {
    "title": "I have started calling my teacher 'Mom'",
    "selftext": "The most embarrassing thing just happened. I raised my hand to ask a question, and I started the sentence with 'Mom, can you...'. The whole class heard it and laughed. I wish the earth would swallow me. How do I get over this embarrassment? I have to have her for the rest of the year.",
    "label": "Work, Study & Career"
  },
  {
    "title": "My friend has started dating my female friend's ex-boyfriend",
    "selftext": "The situation is complicated. My good friend has started seeing my good female friend's ex-boyfriend. They broke up half a year ago, and my female friend is still upset. Now I'm stuck in the middle. My female friend is angry, and my friend doesn't understand the problem. What are the unwritten rules here?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "My hands shake when I have to do something precise",
    "selftext": "When I have to do something that requires a steady hand, such as taking a picture, pouring something into a glass, or inserting a key into a lock, my hands start to shake. It's so annoying. It's not because I'm nervous. Are there others who experience this?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "How do you say no when a street vendor stops you?",
    "selftext": "I am bad at saying no, so I always end up in a 10-minute conversation with a street vendor from a charity organization. I don't want to sign up for anything. What is the most effective, yet still polite, way to end the conversation and move on?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "How do you get ants out of your apartment?",
    "selftext": "There has come a whole army of ants into my kitchen. They march in a long line across the floor. I have tried to wipe them up, but new ones keep coming. Is there a household tip or a remedy that can effectively get them to disappear? I am going crazy.",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People who don't use turn signals at a roundabout",
    "selftext": "My biggest frustration in traffic.\nPeople who drive into a roundabout and leave it again without signaling right.\nYou hold and wait to be able to enter because you think they will continue around.\nIt's a waste of everyone's time and creates dangerous situations.\nHow hard can it be to use that little lever?",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend wants us to go on an 'active holiday', and I just want to lie by the pool",
    "selftext": "We need to plan a summer holiday. My boyfriend wants to go hiking in the mountains and cycle long rides. I dream of lying on a sun lounger with a book and a drink for 14 days. We are fundamentally at odds about what a good holiday is. How do we find a compromise so that we both get a good trip?",
    "label": "Love & Dating"
  },
  {
    "title": "My grandfather has started telling racist jokes",
    "selftext": "My grandfather is from another generation, but lately he has started telling some really inappropriate and racist jokes when the family is together. It creates an incredibly awkward atmosphere. No one dares to say anything to him. Should we just ignore it because he's old, or should we speak up?",
    "label": "Family Dynamics"
  },
  {
    "title": "I am the only one on my team who hasn't been abroad",
    "selftext": "At my university it seems like everyone else has been traveling during their gap year – in Asia, South America, etc. I just worked and saved up. Sometimes I feel a bit boring and inexperienced compared to them. Is it a must to have been on a long trip to be interesting?",
    "label": "Work, Study & Career"
  },
  {
    "title": "My friend is a 'flake'",
    "selftext": "I have a friend who is super sweet, but she is a 'flake'. She cancels our appointments at the last minute with a vague excuse, or she just doesn't show up at all. It's so frustrating and disrespectful towards my time. I'm getting tired of it, but I care a lot about her. What do I do?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I am afraid of swallowing pills",
    "selftext": "I simply cannot swallow pills, not even small pain pills. I get a feeling that it gets stuck in my throat, and I panic. That means I always have to crush them or take liquid medicine, which is quite inconvenient. Has anyone had the same problem and found a trick to overcome it?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "My neighbor has posted a note saying that I am too noisy",
    "selftext": "There was a note hanging in the hallway today, addressed to 'the resident in 2nd floor', stating that my music is too loud in the evening. I am embarrassed, but also irritated that they didn't just knock on my door. I don't even play very loudly. How do I handle this? Should I go down and apologize?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "What is the best way to store leftover pizza?",
    "selftext": "How do you store pizza leftovers so that they remain tasty the next day? If I put them in the fridge in the container, the crust gets soggy and bland. Should each piece be wrapped in foil? And what is the best way to reheat them? Oven, pan, or microwave?",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People who don't give up their seat on the bus to the elderly",
    "selftext": "I saw a young, fresh person sit down on the bus today, while an elderly lady with a cane had to stand up. It makes me so angry. Where has the ordinary humanity and respect gone? It should be a given to stand up for someone who clearly needs the space more.",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My girlfriend is on an endless diet",
    "selftext": "My girlfriend is always trying a new diet. Keto, paleo, fasting... It's impossible to keep up. That means we rarely get to eat the same thing, and she constantly talks about what she 'may' and 'may not' eat. It's become an obsession. I'm worried about her. How can I support her without encouraging unhealthy behavior?",
    "label": "Love & Dating"
  },
  {
    "title": "My mom FaceTimes me without notice",
    "selftext": "My mom has discovered FaceTime, and she now always calls on video without texting first. It's often at the most inconvenient times, when I'm just waking up or sitting on the bus. I'd rather just have a normal call. How can I get her to understand that one should ask before calling on FaceTime?",
    "label": "Family Dynamics"
  },
  {
    "title": "My boss sends me tasks right before the end of my shift",
    "selftext": "My boss has a habit of bringing a 'small, quick task' ten minutes before I am off. The task is never small or quick, so I always end up having to stay longer. It feels like poor planning on his part. Can I say that I will do it tomorrow, or is it expected that I stay?",
    "label": "Work, Study & Career"
  },
  {
    "title": "Is it okay to think that a friend's baby is not cute?",
    "selftext": "My friend just had a baby, and everyone says it's 'sooo cute'. Honestly, I think it looks like a little, sour potato. I feel like a terrible person. Is it normal not to think that all babies are adorable? Of course I act like I think it's the cutest in the world.",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I have trouble saying 'r'",
    "selftext": "I have always had trouble pronouncing 'r' correctly. It's not a big problem, but I'm aware of it, and I sometimes avoid words with many 'r's in them. I feel a bit childish because of it. Is it something one can train out of as an adult, or is it just the way I speak?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "Is it a bad idea to rent out an apartment on Airbnb?",
    "selftext": "I will be traveling for a month in the summer and am considering renting out my apartment on Airbnb to earn a little extra. Is it a good idea? I'm worried that my belongings might be stolen or damaged. What are your experiences with it? Is the hassle worth it?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "How do you avoid getting shocks from a shopping cart?",
    "selftext": "Every time I'm down to shop, I get small, annoying shocks from the metal parts of the shopping cart. It's especially bad in winter. Why does this happen? And is there a trick to avoid it? It's starting to give me a phobia of shopping.",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People who slow down to look at an accident",
    "selftext": "There's been a small traffic accident in the opposite lane. No one was injured. Still, all the cars in my lane slow down to crawl speed to stare. It creates a huge queue that is completely unnecessary. Keep driving! It's disrespectful to those involved and annoying to everyone else.",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend watches porn every day",
    "selftext": "I completely lost feelings for my boyfriend over three years when I saw his browsing history. He watches porn almost daily. When I confronted him about it, he said it was completely normal and nothing to worry about. I feel inadequate and betrayed. Am I paranoid, or is it a sign that something is wrong in our relationship?",
    "label": "Love & Dating"
  },
  {
    "title": "My brother borrows my stuff without asking",
    "selftext": "My 19-year-old brother just walks into my room and 'borrows' my stuff without asking – headphones, jackets, and even my gaming headset, which he destroyed. He doesn't think it's a problem because 'we're family'. I get so irritated. How do I get him to respect my boundaries?",
    "label": "Family Dynamics"
  },
  {
    "title": "I am overqualified for my job",
    "selftext": "I have a master's degree, but I work as a receptionist. My boss keeps saying that it's just a 'transition', but I've been here for three years now. I don't feel that I'm developing professionally at all, and that makes me depressed. Should I find a new job, or should I try to fight for a position with more responsibility, where I am now?",
    "label": "Work, Study & Career"
  },
  {
    "title": "I get social anxiety at parties",
    "selftext": "When I arrive at a party, I usually go straight to the bathroom or hide behind my phone. I have no idea how to start a conversation with people I don't know. Even though I'm out with friends, I feel completely alone. Do you have any tips on how to become more relaxed in social situations?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I think I'm allergic to my new job",
    "selftext": "Shortly after I started my new job, I began to develop rashes and headaches every day. My doctor thinks it could be psychosomatic stress from the work, which is extremely pressured. Should I quit, or am I just sensitive?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "My husband does not want more children",
    "selftext": "We have a 3-year-old son, and I really dream of having another child. But my husband says 'never again'. The birth was hard for me, but I've dreamed of a big family since I was little. I don't know if I can accept his decision, or if it will end up ruining our relationship.",
    "label": "Family Dynamics"
  },
  {
    "title": "How do I get rid of banana flies?",
    "selftext": "There is one single, annoying banana fly that has been bothering me for three weeks now! I have cleaned everything, thrown out all fruit, and set up traps – nothing works. It's a small thing, but I'm starting to go crazy. Help!",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People who talk loudly on the phone in the bus",
    "selftext": "Why do some people think it's okay to have a loud phone conversation in a packed bus? We others are forced to hear about their privacy. 'Yes, and then I said to Birgitte...' I don't care! Write a message like all of us others.",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "Should I meet my ex?",
    "selftext": "My ex wrote yesterday and asked if we should meet to 'talk'. We broke up half a year ago, and it was not nice. My new boyfriend (we have been together for 2 months) is absolutely against me meeting her. I am uncertain – what if there are still feelings?",
    "label": "Love & Dating"
  },
  {
    "title": "My father threatens to make me illegitimate",
    "selftext": "My parents are divorced, and my father has always been difficult to deal with. The last time I visited him, I told him that I didn't vote for the same party as him. He got furious and said he would make me illegitimate. I'm in shock. Am I overreacting when I'm hurt by it?",
    "label": "Family Dynamics"
  },
  {
    "title": "I am panically anxious about the exam",
    "selftext": "My exam is in two weeks, and I am starting to panic and cannot sleep. I have studied, but I am convinced that I will fail anyway. My brain shuts down completely when I get stressed. How do I overcome exam anxiety?",
    "label": "Work, Study & Career"
  },
  {
    "title": "My best friend is getting married, and I can't afford to go",
    "selftext": "My best friend is having her wedding somewhere abroad, which I simply cannot afford to travel to. She didn't even ask if it was possible for me – she just assumed I could pay to be there. I'm really sorry. Should I tell her, or just accept it?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "I get the craziest hangovers",
    "selftext": "Even though I only drink 4-5 beers, I wake up with the worst hangovers. My friends can drink twice as much without problems. My doctor just says I should drink more water, but that doesn't help. Are there others who have tried it?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "My friend borrows money without paying it back",
    "selftext": "My friend borrowed 500 kroner from me two months ago. I gently reminded her about it once, but she ignored it completely. I can't just afford to write the money off. How can I get them back without ruining our friendship?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "Are we ready to have children?",
    "selftext": "My husband and I have been married for a year, and he thinks it’s time to have children. I’m only 24 and don’t feel ready at all. I want to experience more before we start a family. He says I can’t keep putting it off. How do we find a compromise?",
    "label": "Family Dynamics"
  },
  {
    "title": "How do you remove wood splinters from a carpet?",
    "selftext": "My floor carpet is filled with small wood splinters after we installed door jambs. I have vacuumed and swept, but nothing works. Is there anyone who knows a trick to get them out?",
    "label": "Practical Questions & Everyday Life"
  },
  {
    "title": "People who send long voice messages",
    "selftext": "My mother and grandmother have started sending me long voice messages on WhatsApp. It's completely absurd – why not just write? The sound quality is bad, and half of what they say is incomprehensible. Why do older people do that?",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "My boyfriend is jealous of my girlfriends",
    "selftext": "My boyfriend gets jealous every time I go out with my girlfriends. He thinks I spend more time with them than with him. I feel I constantly have to defend my friendships. It drains me of energy, and I lose the desire to see them. What should I do?",
    "label": "Love & Dating"
  },
  {
    "title": "My son wants to shave his eyebrows",
    "selftext": "My 12-year-old son wants to shave his eyebrows, 'just like they do on TikTok'. I think it's a completely ridiculous idea. He says that I don't understand him at all. Should I give him permission, or should I stand firm?",
    "label": "Family Dynamics"
  },
  {
    "title": "My boss is bullying me",
    "selftext": "My boss is bullying me in a passive-aggressive way – she ignores my input to meetings and gives others the credit for my work. It's starting to break me mentally. I don't have the energy to confront her. Should I just quit and find something new?",
    "label": "Work, Study & Career"
  },
  {
    "title": "I am gay, but my family doesn't know",
    "selftext": "I live a double life. My family thinks I am heterosexual, but I am attracted to men. I cannot tell them to my strongly religious parents – it would ruin everything. How long can I keep it hidden? I am 18 and just want to live my life.",
    "label": "Family Dynamics"
  },
  {
    "title": "My boyfriend still lives at his parents' house",
    "selftext": "My boyfriend is 28 years old and still lives at home. He does not help around the house; his mother does everything for him. We have been together for two years, and he never mentions moving. I cannot see a future with a man who cannot take care of himself. What should I do?",
    "label": "Love & Dating"
  },
  {
    "title": "How to support a female friend with depression?",
    "selftext": "My closest friend has just been diagnosed with depression. I want to do everything to help, but I don't know what to say or do. I'm afraid of saying something wrong. Do you have any advice on how I can support her in the best possible way?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "My boyfriend seems uninterested in my life",
    "selftext": "When I tell my boyfriend about my day at work, he yawns or looks at his phone. I don't feel he listens at all. But when his friends are visiting, he is full of energy and chatter. Have I just become boring?",
    "label": "Love & Dating"
  },
  {
    "title": "I get winter depression every year",
    "selftext": "From November to February I become completely energy-depleted. The gray, dampy weather makes me just isolate myself at home and feel bad. I have tried light therapy, but it doesn't really help. Is there anyone who has found a solution to winter depression?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "My husband refuses to buy items on sale",
    "selftext": "My husband spends thousands of kroner on things he doesn't need, but gets angry if I buy something on sale. 'There are ALWAYS sales,' he says. But I'm saving the family money! How do I get him to understand?",
    "label": "Personal Finance & Housing"
  },
  {
    "title": "How do you avoid becoming lonely?",
    "selftext": "I am 35, single and have no children. Most of my friends are married and busy with their careers and family. I feel left out and afraid of ending up as 'the crazy cat lady'. Are there others in the same situation? How do you handle it?",
    "label": "Friendship & Social Life"
  },
  {
    "title": "How much skincare is too much?",
    "selftext": "My friend spends 45 minutes every morning on her skincare routine – 10 different products. I just use a facial wash and a moisturizer. She says I'm ruining my skin. Is she hysterical, or do I need a more advanced routine?",
    "label": "Health & Wellness (Physical and Mental)"
  },
  {
    "title": "People cycling on the sidewalk",
    "selftext": "Cyclists who come thundering onto the sidewalk at full speed without ringing the bell. One barely has time to jump for one's life. There is a bike path right next to it! Why should the sidewalk be used as their personal race track?",
    "label": "Everyday Observations & Rants"
  },
  {
    "title": "I have become a vegan, and my family is furious",
    "selftext": "I have decided to become a vegan, and my family has gone crazy. My mother is convinced that I will die of protein deficiency, and my brother calls it a 'modern dill'. I just don't feel good about eating animals anymore. How do I get them to respect my choice?",
    "label": "Family Dynamics"
  },
  {
    "title": "My boss asks too much about my private life",
    "selftext": "My boss constantly asks about my love life, my family situation, and my finances. It feels inappropriate, but he's my boss, so I answer politely. I feel my boundaries are being crossed. How can I get him to stop?",
    "label": "Work, Study & Career"
  }
]